/*************************************************************
 *
 *  MathJax/jax/output/HTML-CSS/fonts/STIX/General/Regular/SpacingModLetters.js
 *
 *  Copyright (c) 2009 Design Science, Inc.
 *
 *  Licensed under the Apache License, Version 2.0 (the "License");
 *  you may not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS,
 *  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 *
 */

MathJax.Hub.Insert(
  MathJax.OutputJax['HTML-CSS'].FONTDATA.FONTS['STIXGeneral'],
  {
    0x2B0: [848,-336,378,7,365],       // ʰ
    0x2B1: [848,-336,378,7,365],       // ʱ
    0x2B2: [852,-169,300,44,244],      // ʲ
    0x2B3: [681,-336,252,5,252],       // ʳ
    0x2B4: [680,-335,277,10,257],      // ʴ
    0x2B5: [680,-168,325,10,338],      // ʵ
    0x2B6: [680,-335,390,6,379],       // ʶ
    0x2B7: [680,-331,520,6,512],       // ʷ
    0x2B8: [680,-176,370,14,361],      // ʸ
    0x2B9: [684,-421,208,90,257],      // ʹ
    0x2BA: [684,-421,305,19,324],      // ʺ
    0x2BB: [686,-443,333,79,218],      // ʻ
    0x2BC: [686,-443,333,79,218],      // ʼ
    0x2BD: [686,-443,333,79,218],      // ʽ
    0x2BE: [680,-485,198,35,163],      // ʾ
    0x2BF: [680,-485,198,35,163],      // ʿ
    0x2C0: [690,-295,326,23,303],      // ˀ
    0x2C1: [690,-295,326,23,303],      // ˁ
    0x2C2: [755,-419,317,33,285],      // ˂
    0x2C3: [755,-419,317,33,285],      // ˃
    0x2C4: [713,-461,317,-9,327],      // ˄
    0x2C5: [713,-461,317,-9,327],      // ˅
    0x2C6: [674,-507,333,11,322],      // ˆ
    0x2C7: [674,-507,333,11,322],      // ˇ
    0x2C8: [713,-448,278,119,159],     // ˈ
    0x2C9: [601,-547,334,11,322],      // ˉ
    0x2CA: [679,-509,333,93,320],      // ˊ
    0x2CB: [679,-509,333,22,249],      // ˋ
    0x2CC: [70,195,278,119,159],       // ˌ
    0x2CD: [-104,159,334,11,323],      // ˍ
    0x2CE: [-21,192,333,25,249],       // ˎ
    0x2CF: [-21,192,333,84,308],       // ˏ
    0x2D0: [460,-19,333,89,244],       // ː
    0x2D1: [460,-299,333,89,244],      // ˑ
    0x2D2: [365,-75,333,72,262],       // ˒
    0x2D3: [365,-75,333,71,261],       // ˓
    0x2D4: [205,-18,333,51,281],       // ˔
    0x2D5: [205,-18,333,51,281],       // ˕
    0x2D6: [218,-26,333,71,263],       // ˖
    0x2D7: [144,-100,333,71,263],      // ˗
    0x2D8: [664,-507,335,27,308],      // ˘
    0x2D9: [622,-523,333,118,217],     // ˙
    0x2DA: [711,-512,333,67,266],      // ˚
    0x2DB: [0,165,333,64,249],         // ˛
    0x2DC: [638,-532,333,1,331],       // ˜
    0x2DD: [678,-507,333,-3,376],      // ˝
    0x2DE: [443,-186,298,0,263],       // ˞
    0x2DF: [662,-425,333,48,284],      // ˟
    0x2E0: [684,-219,378,24,335],      // ˠ
    0x2E1: [848,-336,215,19,197],      // ˡ
    0x2E2: [681,-331,291,36,261],      // ˢ
    0x2E3: [680,-336,380,5,372],       // ˣ
    0x2E4: [850,-336,341,45,319],      // ˤ
    0x2E5: [662,0,413,48,373],         // ˥
    0x2E6: [662,0,405,40,365],         // ˦
    0x2E7: [662,0,405,40,365],         // ˧
    0x2E8: [662,0,405,40,365],         // ˨
    0x2E9: [662,0,405,40,365],         // ˩
    0x2EC: [70,147,333,21,311],        // ˬ
    0x2ED: [665,-507,405,10,395]       // ˭
  }
);

MathJax.Ajax.loadComplete(MathJax.OutputJax["HTML-CSS"].fontDir + "/General/Regular/SpacingModLetters.js");
