/*************************************************************
 *
 *  MathJax/jax/output/HTML-CSS/fonts/STIX/General/Regular/GreekSSBold.js
 *
 *  Copyright (c) 2009 Design Science, Inc.
 *
 *  Licensed under the Apache License, Version 2.0 (the "License");
 *  you may not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS,
 *  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 *
 */

MathJax.Hub.Insert(
  MathJax.OutputJax['HTML-CSS'].FONTDATA.FONTS['STIXGeneral'],
  {
    0x1D756: [690,0,690,25,665],       // 𝝖
    0x1D757: [676,0,636,80,594],       // 𝝗
    0x1D758: [676,0,591,80,569],       // 𝝘
    0x1D759: [690,0,720,40,680],       // 𝝙
    0x1D75A: [676,0,635,80,597],       // 𝝚
    0x1D75B: [676,0,653,25,623],       // 𝝛
    0x1D75C: [676,0,715,80,635],       // 𝝜
    0x1D75D: [691,19,778,35,743],      // 𝝝
    0x1D75E: [676,0,440,65,375],       // 𝝞
    0x1D75F: [676,0,712,80,707],       // 𝝟
    0x1D760: [690,0,706,40,666],       // 𝝠
    0x1D761: [676,0,913,80,833],       // 𝝡
    0x1D762: [676,18,724,80,644],      // 𝝢
    0x1D763: [676,0,640,35,605],       // 𝝣
    0x1D764: [692,18,778,35,743],      // 𝝤
    0x1D765: [676,0,715,80,635],       // 𝝥
    0x1D766: [676,0,581,80,569],       // 𝝦
    0x1D767: [691,19,778,35,743],      // 𝝧
    0x1D768: [676,0,674,28,632],       // 𝝨
    0x1D769: [676,0,641,14,627],       // 𝝩
    0x1D76A: [691,0,748,20,728],       // 𝝪
    0x1D76B: [676,0,800,25,775],       // 𝝫
    0x1D76C: [676,0,740,40,700],       // 𝝬
    0x1D76D: [691,0,806,15,791],       // 𝝭
    0x1D76E: [691,0,752,32,720],       // 𝝮
    0x1D76F: [664,30,735,45,685],      // 𝝯
    0x1D770: [473,14,662,40,629],      // 𝝰
    0x1D771: [692,205,512,39,487],     // 𝝱
    0x1D772: [473,205,502,10,477],     // 𝝲
    0x1D773: [692,14,502,25,477],      // 𝝳
    0x1D774: [473,14,451,25,434],      // 𝝴
    0x1D775: [692,205,500,28,488],     // 𝝵
    0x1D776: [473,205,510,35,474],     // 𝝶
    0x1D777: [692,14,500,23,477],      // 𝝷
    0x1D778: [461,14,319,53,296],      // 𝝸
    0x1D779: [473,0,527,55,512],       // 𝝹
    0x1D77A: [692,14,554,18,520],      // 𝝺
    0x1D77B: [461,205,550,39,517],     // 𝝻
    0x1D77C: [473,14,492,55,472],      // 𝝼
    0x1D77D: [692,205,501,28,489],     // 𝝽
    0x1D77E: [473,14,501,25,476],      // 𝝾
    0x1D77F: [461,14,594,10,572],      // 𝝿
    0x1D780: [473,205,511,38,486],     // 𝞀
    0x1D781: [473,205,498,26,486],     // 𝞁
    0x1D782: [461,14,520,25,552],      // 𝞂
    0x1D783: [461,14,479,6,472],       // 𝞃
    0x1D784: [473,14,514,35,489],      // 𝞄
    0x1D785: [473,205,634,25,609],     // 𝞅
    0x1D786: [473,205,573,9,553],      // 𝞆
    0x1D787: [473,205,680,25,699],     // 𝞇
    0x1D788: [461,14,740,42,689],      // 𝞈
    0x1D789: [691,14,501,25,476],      // 𝞉
    0x1D78A: [473,14,462,25,440],      // 𝞊
    0x1D78B: [692,14,536,35,522],      // 𝞋
    0x1D78C: [473,14,570,14,554],      // 𝞌
    0x1D78D: [692,205,634,25,609],     // 𝞍
    0x1D78E: [473,205,494,25,469],     // 𝞎
    0x1D78F: [461,14,848,6,839]        // 𝞏
  }
);

MathJax.Ajax.loadComplete(MathJax.OutputJax["HTML-CSS"].fontDir + "/General/Regular/GreekSSBold.js");
