/*************************************************************
 *
 *  MathJax/jax/output/HTML-CSS/fonts/STIX/General/Regular/MathBold.js
 *
 *  Copyright (c) 2009 Design Science, Inc.
 *
 *  Licensed under the Apache License, Version 2.0 (the "License");
 *  you may not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS,
 *  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 *
 */

MathJax.Hub.Insert(
  MathJax.OutputJax['HTML-CSS'].FONTDATA.FONTS['STIXGeneral'],
  {
    0x1D400: [690,0,722,9,689],        // 𝐀
    0x1D401: [676,0,667,16,619],       // 𝐁
    0x1D402: [691,19,722,49,687],      // 𝐂
    0x1D403: [676,0,722,14,690],       // 𝐃
    0x1D404: [676,0,667,16,641],       // 𝐄
    0x1D405: [676,0,611,16,583],       // 𝐅
    0x1D406: [691,19,778,37,755],      // 𝐆
    0x1D407: [676,0,778,21,759],       // 𝐇
    0x1D408: [676,0,389,20,370],       // 𝐈
    0x1D409: [676,96,500,3,478],       // 𝐉
    0x1D40A: [676,0,778,30,769],       // 𝐊
    0x1D40B: [676,0,667,19,638],       // 𝐋
    0x1D40C: [676,0,944,14,921],       // 𝐌
    0x1D40D: [676,18,722,16,701],      // 𝐍
    0x1D40E: [691,19,778,35,743],      // 𝐎
    0x1D40F: [676,0,611,16,600],       // 𝐏
    0x1D410: [691,176,778,35,743],     // 𝐐
    0x1D411: [676,0,722,26,716],       // 𝐑
    0x1D412: [692,19,556,35,513],      // 𝐒
    0x1D413: [676,0,667,31,636],       // 𝐓
    0x1D414: [676,19,722,16,701],      // 𝐔
    0x1D415: [676,18,722,16,701],      // 𝐕
    0x1D416: [676,15,1000,19,981],     // 𝐖
    0x1D417: [676,0,722,16,699],       // 𝐗
    0x1D418: [676,0,722,15,699],       // 𝐘
    0x1D419: [676,0,667,28,634],       // 𝐙
    0x1D41A: [473,14,500,25,488],      // 𝐚
    0x1D41B: [676,14,556,17,521],      // 𝐛
    0x1D41C: [473,14,444,25,430],      // 𝐜
    0x1D41D: [676,14,556,25,534],      // 𝐝
    0x1D41E: [473,14,444,25,427],      // 𝐞
    0x1D41F: [691,0,333,14,389],       // 𝐟
    0x1D420: [472,206,500,28,483],     // 𝐠
    0x1D421: [676,0,556,15,534],       // 𝐡
    0x1D422: [691,0,278,15,256],       // 𝐢
    0x1D423: [691,203,333,-57,263],    // 𝐣
    0x1D424: [676,0,556,22,543],       // 𝐤
    0x1D425: [676,0,278,15,256],       // 𝐥
    0x1D426: [473,0,833,15,814],       // 𝐦
    0x1D427: [473,0,556,21,539],       // 𝐧
    0x1D428: [473,14,500,25,476],      // 𝐨
    0x1D429: [473,205,556,19,524],     // 𝐩
    0x1D42A: [473,205,556,34,536],     // 𝐪
    0x1D42B: [473,0,444,28,434],       // 𝐫
    0x1D42C: [473,14,389,25,361],      // 𝐬
    0x1D42D: [630,12,333,19,332],      // 𝐭
    0x1D42E: [461,14,556,16,538],      // 𝐮
    0x1D42F: [461,14,500,21,485],      // 𝐯
    0x1D430: [461,14,722,23,707],      // 𝐰
    0x1D431: [461,0,500,12,484],       // 𝐱
    0x1D432: [461,205,500,16,482],     // 𝐲
    0x1D433: [461,0,444,21,420],       // 𝐳
    0x1D7CE: [688,13,500,24,476],      // 𝟎
    0x1D7CF: [688,0,500,65,441],       // 𝟏
    0x1D7D0: [688,0,500,17,478],       // 𝟐
    0x1D7D1: [688,14,500,16,468],      // 𝟑
    0x1D7D2: [688,0,500,19,476],       // 𝟒
    0x1D7D3: [676,8,500,22,470],       // 𝟓
    0x1D7D4: [688,13,500,28,475],      // 𝟔
    0x1D7D5: [676,0,500,17,477],       // 𝟕
    0x1D7D6: [688,13,500,28,472],      // 𝟖
    0x1D7D7: [688,13,500,26,473]       // 𝟗
  }
);

MathJax.Ajax.loadComplete(MathJax.OutputJax["HTML-CSS"].fontDir + "/General/Regular/MathBold.js");
