/*************************************************************
 *
 *  MathJax/jax/output/HTML-CSS/fonts/STIX/General/Regular/MathTT.js
 *
 *  Copyright (c) 2009 Design Science, Inc.
 *
 *  Licensed under the Apache License, Version 2.0 (the "License");
 *  you may not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS,
 *  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 *
 */

MathJax.Hub.Insert(
  MathJax.OutputJax['HTML-CSS'].FONTDATA.FONTS['STIXGeneral'],
  {
    0x1D670: [673,0,525,26,496],       // 𝙰
    0x1D671: [662,0,525,29,480],       // 𝙱
    0x1D672: [672,11,525,40,482],      // 𝙲
    0x1D673: [662,0,525,25,483],       // 𝙳
    0x1D674: [662,0,525,31,500],       // 𝙴
    0x1D675: [662,0,525,34,488],       // 𝙵
    0x1D676: [672,11,525,37,495],      // 𝙶
    0x1D677: [662,0,525,26,496],       // 𝙷
    0x1D678: [662,0,525,84,438],       // 𝙸
    0x1D679: [662,11,525,85,476],      // 𝙹
    0x1D67A: [662,0,525,30,494],       // 𝙺
    0x1D67B: [662,0,525,37,487],       // 𝙻
    0x1D67C: [662,0,525,21,501],       // 𝙼
    0x1D67D: [662,0,525,31,491],       // 𝙽
    0x1D67E: [672,11,525,56,466],      // 𝙾
    0x1D67F: [662,0,525,31,479],       // 𝙿
    0x1D680: [672,139,525,56,466],     // 𝚀
    0x1D681: [662,11,525,26,520],      // 𝚁
    0x1D682: [672,11,525,52,470],      // 𝚂
    0x1D683: [662,0,525,26,496],       // 𝚃
    0x1D684: [662,11,525,9,514],       // 𝚄
    0x1D685: [662,8,525,17,506],       // 𝚅
    0x1D686: [662,8,525,11,512],       // 𝚆
    0x1D687: [662,0,525,24,497],       // 𝚇
    0x1D688: [662,0,525,15,507],       // 𝚈
    0x1D689: [662,0,525,47,479],       // 𝚉
    0x1D68A: [459,6,525,58,516],       // 𝚊
    0x1D68B: [609,6,525,17,481],       // 𝚋
    0x1D68C: [459,6,525,78,464],       // 𝚌
    0x1D68D: [609,6,525,41,505],       // 𝚍
    0x1D68E: [459,6,525,60,462],       // 𝚎
    0x1D68F: [615,0,525,42,437],       // 𝚏
    0x1D690: [461,228,525,29,508],     // 𝚐
    0x1D691: [609,0,525,17,505],       // 𝚑
    0x1D692: [610,0,525,84,448],       // 𝚒
    0x1D693: [610,227,525,47,362],     // 𝚓
    0x1D694: [609,0,525,24,505],       // 𝚔
    0x1D695: [609,0,525,63,459],       // 𝚕
    0x1D696: [456,0,525,2,520],        // 𝚖
    0x1D697: [456,0,525,17,505],       // 𝚗
    0x1D698: [459,6,525,62,460],       // 𝚘
    0x1D699: [456,221,525,17,481],     // 𝚙
    0x1D69A: [456,221,525,45,530],     // 𝚚
    0x1D69B: [456,0,525,37,485],       // 𝚛
    0x1D69C: [459,6,525,72,457],       // 𝚜
    0x1D69D: [580,6,525,25,448],       // 𝚝
    0x1D69E: [450,6,525,17,505],       // 𝚞
    0x1D69F: [450,4,525,22,500],       // 𝚟
    0x1D6A0: [450,4,525,15,508],       // 𝚠
    0x1D6A1: [450,0,525,23,498],       // 𝚡
    0x1D6A2: [450,227,525,24,501],     // 𝚢
    0x1D6A3: [450,0,525,32,473],       // 𝚣
    0x1D7F6: [681,11,525,55,467],      // 𝟶
    0x1D7F7: [681,0,525,110,435],      // 𝟷
    0x1D7F8: [681,0,525,52,470],       // 𝟸
    0x1D7F9: [681,11,525,43,479],      // 𝟹
    0x1D7FA: [682,0,525,29,493],       // 𝟺
    0x1D7FB: [670,11,525,52,470],      // 𝟻
    0x1D7FC: [681,11,525,58,464],      // 𝟼
    0x1D7FD: [686,11,525,43,479],      // 𝟽
    0x1D7FE: [681,11,525,43,479],      // 𝟾
    0x1D7FF: [681,11,525,58,464]       // 𝟿
  }
);

MathJax.Ajax.loadComplete(MathJax.OutputJax["HTML-CSS"].fontDir + "/General/Regular/MathTT.js");
