/*************************************************************
 *
 *  MathJax/jax/output/HTML-CSS/fonts/STIX/General/Bold/MathSSBold.js
 *
 *  Copyright (c) 2009 Design Science, Inc.
 *
 *  Licensed under the Apache License, Version 2.0 (the "License");
 *  you may not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS,
 *  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 *
 */

MathJax.Hub.Insert(
  MathJax.OutputJax['HTML-CSS'].FONTDATA.FONTS['STIXGeneral-bold'],
  {
    0x1D5D4: [690,0,690,25,665],       // 𝗔
    0x1D5D5: [676,0,636,80,594],       // 𝗕
    0x1D5D6: [691,19,723,49,688],      // 𝗖
    0x1D5D7: [676,0,709,80,674],       // 𝗗
    0x1D5D8: [676,0,635,80,597],       // 𝗘
    0x1D5D9: [676,0,582,80,570],       // 𝗙
    0x1D5DA: [691,19,746,37,671],      // 𝗚
    0x1D5DB: [676,0,715,80,635],       // 𝗛
    0x1D5DC: [676,0,440,65,375],       // 𝗜
    0x1D5DD: [676,96,481,15,406],      // 𝗝
    0x1D5DE: [676,0,712,80,707],       // 𝗞
    0x1D5DF: [676,0,603,80,587],       // 𝗟
    0x1D5E0: [676,0,913,80,833],       // 𝗠
    0x1D5E1: [676,18,724,80,644],      // 𝗡
    0x1D5E2: [692,18,778,35,743],      // 𝗢
    0x1D5E3: [676,0,581,80,569],       // 𝗣
    0x1D5E4: [691,176,779,35,754],     // 𝗤
    0x1D5E5: [676,0,670,80,657],       // 𝗥
    0x1D5E6: [691,19,554,35,511],      // 𝗦
    0x1D5E7: [676,0,641,14,627],       // 𝗧
    0x1D5E8: [676,19,699,75,624],      // 𝗨
    0x1D5E9: [676,18,690,25,665],      // 𝗩
    0x1D5EA: [676,15,997,30,967],      // 𝗪
    0x1D5EB: [676,0,740,40,700],       // 𝗫
    0x1D5EC: [676,0,694,20,674],       // 𝗬
    0x1D5ED: [676,0,653,25,623],       // 𝗭
    0x1D5EE: [473,14,489,23,428],      // 𝗮
    0x1D5EF: [676,13,512,55,487],      // 𝗯
    0x1D5F0: [473,14,462,25,442],      // 𝗰
    0x1D5F1: [676,14,518,25,463],      // 𝗱
    0x1D5F2: [473,13,452,25,433],      // 𝗲
    0x1D5F3: [691,0,340,14,374],       // 𝗳
    0x1D5F4: [473,206,504,28,490],     // 𝗴
    0x1D5F5: [676,0,510,55,455],       // 𝗵
    0x1D5F6: [688,0,245,50,195],       // 𝗶
    0x1D5F7: [688,203,324,-57,269],    // 𝗷
    0x1D5F8: [676,0,519,55,506],       // 𝗸
    0x1D5F9: [676,0,235,55,180],       // 𝗹
    0x1D5FA: [473,0,776,55,721],       // 𝗺
    0x1D5FB: [473,0,510,55,455],       // 𝗻
    0x1D5FC: [473,14,501,25,476],      // 𝗼
    0x1D5FD: [473,205,512,55,487],     // 𝗽
    0x1D5FE: [473,205,512,25,457],     // 𝗾
    0x1D5FF: [473,0,411,55,406],       // 𝗿
    0x1D600: [473,13,385,25,357],      // 𝘀
    0x1D601: [630,12,386,7,371],       // 𝘁
    0x1D602: [461,15,518,55,463],      // 𝘂
    0x1D603: [461,14,462,15,447],      // 𝘃
    0x1D604: [461,14,701,17,684],      // 𝘄
    0x1D605: [461,0,506,20,486],       // 𝘅
    0x1D606: [461,205,472,18,455],     // 𝘆
    0x1D607: [461,0,441,21,417],       // 𝘇
    0x1D7EC: [688,13,500,24,476],      // 𝟬
    0x1D7ED: [688,0,500,82,334],       // 𝟭
    0x1D7EE: [688,0,500,20,474],       // 𝟮
    0x1D7EF: [688,13,500,18,479],      // 𝟯
    0x1D7F0: [688,0,500,19,484],       // 𝟰
    0x1D7F1: [676,13,500,13,483],      // 𝟱
    0x1D7F2: [688,13,500,26,475],      // 𝟲
    0x1D7F3: [676,0,500,35,471],       // 𝟳
    0x1D7F4: [688,13,500,28,472],      // 𝟴
    0x1D7F5: [688,13,500,26,475]       // 𝟵
  }
);

MathJax.Ajax.loadComplete(MathJax.OutputJax["HTML-CSS"].fontDir + "/General/Bold/MathSSBold.js");
