/*************************************************************
 *
 *  MathJax/jax/output/HTML-CSS/fonts/STIX/General/Bold/SpacingModLetters.js
 *
 *  Copyright (c) 2009 Design Science, Inc.
 *
 *  Licensed under the Apache License, Version 2.0 (the "License");
 *  you may not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS,
 *  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 *
 */

MathJax.Hub.Insert(
  MathJax.OutputJax['HTML-CSS'].FONTDATA.FONTS['STIXGeneral-bold'],
  {
    0x2B0: [842,-335,378,6,365],       // ʰ
    0x2B1: [848,-336,378,7,365],       // ʱ
    0x2B2: [868,-179,300,25,273],      // ʲ
    0x2B3: [699,-335,270,12,266],      // ʳ
    0x2B4: [690,-326,292,10,264],      // ʴ
    0x2B5: [690,-163,319,10,342],      // ʵ
    0x2B6: [684,-345,404,20,397],      // ʶ
    0x2B7: [681,-331,550,23,528],      // ʷ
    0x2B8: [690,-179,380,16,374],      // ʸ
    0x2B9: [684,-421,208,30,216],      // ʹ
    0x2BA: [684,-421,356,19,364],      // ʺ
    0x2BB: [685,-350,333,39,223],      // ʻ
    0x2BC: [686,-351,333,39,223],      // ʼ
    0x2BD: [686,-351,250,39,223],      // ʽ
    0x2BE: [662,-382,334,65,250],      // ʾ
    0x2BF: [662,-382,334,65,250],      // ʿ
    0x2C0: [690,-240,353,30,333],      // ˀ
    0x2C1: [690,-240,353,30,333],      // ˁ
    0x2C2: [760,-414,317,30,297],      // ˂
    0x2C3: [760,-414,317,30,297],      // ˃
    0x2C4: [720,-453,317,-14,332],     // ˄
    0x2C5: [720,-453,317,-14,332],     // ˅
    0x2C6: [704,-528,333,-2,335],      // ˆ
    0x2C7: [704,-528,333,-2,335],      // ˇ
    0x2C8: [720,-455,279,112,167],     // ˈ
    0x2C9: [637,-565,370,20,350],      // ˉ
    0x2CA: [713,-528,266,20,258],      // ˊ
    0x2CB: [713,-528,266,20,258],      // ˋ
    0x2CC: [70,195,278,112,167],       // ˌ
    0x2CD: [-88,160,370,20,350],       // ˍ
    0x2CE: [-7,192,333,15,253],        // ˎ
    0x2CF: [-7,192,333,80,318],        // ˏ
    0x2D0: [474,-4,333,79,254],        // ː
    0x2D1: [474,-294,333,79,254],      // ˑ
    0x2D2: [378,-62,333,65,268],       // ˒
    0x2D3: [378,-62,333,65,268],       // ˓
    0x2D4: [206,-4,333,51,281],        // ˔
    0x2D5: [206,-4,333,51,281],        // ˕
    0x2D6: [227,-9,334,61,273],        // ˖
    0x2D7: [150,-84,334,61,273],       // ˗
    0x2D8: [691,-528,333,15,318],      // ˘
    0x2D9: [666,-537,333,102,231],     // ˙
    0x2DA: [750,-537,333,60,273],      // ˚
    0x2DB: [44,173,333,90,319],        // ˛
    0x2DC: [674,-547,333,-16,349],     // ˜
    0x2DD: [713,-528,333,-13,425],     // ˝
    0x2DE: [481,-186,292,0,302],       // ˞
    0x2DF: [744,-506,260,10,250],      // ˟
    0x2E0: [684,-190,420,10,410],      // ˠ
    0x2E1: [842,-335,190,5,186],       // ˡ
    0x2E2: [695,-320,300,19,278],      // ˢ
    0x2E3: [690,-335,380,12,376],      // ˣ
    0x2E4: [855,-335,328,20,323],      // ˤ
    0x2E5: [676,0,405,40,368],         // ˥
    0x2E6: [676,0,405,40,368],         // ˦
    0x2E7: [676,0,405,40,368],         // ˧
    0x2E8: [676,0,405,40,368],         // ˨
    0x2E9: [676,0,405,40,368],         // ˩
    0x2EC: [70,167,314,5,309],         // ˬ
    0x2ED: [720,-528,395,5,390]        // ˭
  }
);

MathJax.Ajax.loadComplete(MathJax.OutputJax["HTML-CSS"].fontDir + "/General/Bold/SpacingModLetters.js");
