/*************************************************************
 *
 *  MathJax/jax/output/HTML-CSS/fonts/TeX/fontdata.js
 *  
 *  Initializes the HTML-CSS OutputJax to use the MathJax TeX fonts
 *  for displaying mathematics.
 *
 *  ---------------------------------------------------------------------
 *  
 *  Copyright (c) 2009 Design Science, Inc.
 *
 *  Licensed under the Apache License, Version 2.0 (the "License");
 *  you may not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS,
 *  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 */

(function (HTMLCSS,TEX,MML,AJAX) {

  HTMLCSS.Augment({
    FONTDATA: {
      TeX_factor: 1,    // TeX em's to font em's
      baselineskip: 1.2,
      lineH: .8, lineD: .2,
      
      hasStyleChar: true,  // char 0xEFFD encodes font style
 
      FONTS: {
        "MathJax_Main":             "Main/Regular/Main.js",
        "MathJax_Main-bold":        "Main/Bold/Main.js",
        "MathJax_Main-italic":      "Main/Italic/Main.js",
        "MathJax_Math-italic":      "Math/Italic/Main.js",
        "MathJax_Caligraphic":      "Caligraphic/Regular/Main.js",
        "MathJax_Size1":            "Size1/Regular/Main.js",
        "MathJax_Size2":            "Size2/Regular/Main.js",
        "MathJax_Size3":            "Size3/Regular/Main.js",
        "MathJax_Size4":            "Size4/Regular/Main.js",
        "MathJax_AMS":              "AMS/Regular/Main.js",
        "MathJax_Fraktur":          "Fraktur/Regular/Main.js",
        "MathJax_Fraktur-bold":     "Fraktur/Bold/Main.js",
        "MathJax_SansSerif":        "SansSerif/Regular/Main.js",
        "MathJax_SansSerif-bold":   "SansSerif/Bold/Main.js",
        "MathJax_SansSerif-italic": "SansSerif/Italic/Main.js",
        "MathJax_Script":           "Script/Regular/Main.js",
        "MathJax_Script-bold":      "Script/Bold/Main.js",
        "MathJax_Typewriter":       "Typewriter/Regular/Main.js"
      },
      
      DEFAULTFAMILY: "MathJax_Main", DEFAULTWEIGHT: "normal", DEFAULTSTYLE: "normal",

      VARIANT: {
        "normal": {fonts:["MathJax_Main","MathJax_Size1","MathJax_AMS"]},
        "bold":   {fonts:["MathJax_Main-bold","MathJax_Size1","MathJax_AMS"]},
        "italic": {fonts:["MathJax_Math-italic","MathJax_Main","MathJax_Size1","MathJax_AMS"],
                   offsetN: 0x30, variantN: "normal"},
        "bold-italic": {fonts:["MathJax_Main-bold","MathJax_Size1","MathJax_AMS"]},
        "double-struck": {fonts:["MathJax_AMS", "MathJax_Main"]},
        "fraktur": {fonts:["MathJax_Fraktur","MathJax_Main","MathJax_Size1","MathJax_AMS"]},
        "bold-fraktur": {fonts:["MathJax_Fraktur-bold","MathJax_Main-bold","MathJax_Size1","MathJax_AMS"]},
        "script": {fonts:["MathJax_Script","MathJax_Main","MathJax_Size1","MathJax_AMS"]},
        "bold-script": {fonts:["MathJax_Script-bold","MathJax_Main-bold","MathJax_Size1","MathJax_AMS"]},
        "sans-serif": {fonts:["MathJax_SansSerif","MathJax_Main","MathJax_Size1","MathJax_AMS"]},
        "bold-sans-serif": {fonts:["MathJax_SansSerif-bold","MathJax_Main-bold","MathJax_Size1","MathJax_AMS"]},
        "sans-serif-italic": {fonts:["MathJax_SansSerif-italic","MathJax_Main-italic","MathJax_Size1","MathJax_AMS"]},
//        "sans-serif-bold-italic": {weight: "bold", style: "italic", offsetA: 0x1D63C, offsetN: 0xE1F6, offsetG: 0x1D790},
        "monospace": {fonts:["MathJax_Typewriter","MathJax_Main","MathJax_Size1","MathJax_AMS"]},
        "-tex-caligraphic": {fonts:["MathJax_Caligraphic","MathJax_Main"], offsetA: 0x41, variantA: "italic"},
        "-tex-oldstyle": {fonts:["MathJax_Caligraphic","MathJax_Main"]},
        "-largeOp": {fonts:["MathJax_Size2","MathJax_Size1","MathJax_Main"]},
        "-smallOp": {fonts:["MathJax_Size1","MathJax_Main"]}
      },
      
      RANGES: [
        {name: "alpha", low: 0x61, high: 0x7A, offset: "A", add: 32},
        {name: "number", low: 0x30, high: 0x39, offset: "N"}
      ],
      
      RULECHAR: 0x2212,
      
      DELIMITERS: {
        0x0028: // (
         [[1,"MathJax_Main"],[1.2,"MathJax_Size1"],[1.8,"MathJax_Size2"],[2.4,"MathJax_Size3"],[3.0,"MathJax_Size4"],
          {top: [0x239B,"MathJax_Size1"], ext: [0x239C,"MathJax_Size1"], bot: [0x239D,"MathJax_Size1"], direction:"Vertical"}],
        0x0029: // )
         [[1,"MathJax_Main"],[1.2,"MathJax_Size1"],[1.8,"MathJax_Size2"],[2.4,"MathJax_Size3"],[3.0,"MathJax_Size4"],
          {top: [0x239E,"MathJax_Size1"], ext: [0x239F,"MathJax_Size1"], bot: [0x23A0,"MathJax_Size1"], direction:"Vertical"}],
        0x002F: // /
         [[1,"MathJax_Main"],[1.2,"MathJax_Size1"],[1.8,"MathJax_Size2"],[2.4,"MathJax_Size3"],[3.0,"MathJax_Size4"],{stop:1, direction:"Vertical"}],
        0x005B: // [
         [[1,"MathJax_Main"],[1.2,"MathJax_Size1"],[1.8,"MathJax_Size2"],[2.4,"MathJax_Size3"],[3.0,"MathJax_Size4"],
          {top: [0x23A1,"MathJax_Size1"], ext: [0x23A2,"MathJax_Size1"], bot: [0x23A3,"MathJax_Size1"], direction:"Vertical"}],
        0x005C: // \
         [[1,"MathJax_Main"],[1.2,"MathJax_Size1"],[1.8,"MathJax_Size2"],[2.4,"MathJax_Size3"],[3.0,"MathJax_Size4"],{stop:1, direction:"Vertical"}],
        0x005D: // ]
         [[1,"MathJax_Main"],[1.2,"MathJax_Size1"],[1.8,"MathJax_Size2"],[2.4,"MathJax_Size3"],[3.0,"MathJax_Size4"],
          {top: [0x23A4,"MathJax_Size1"], ext: [0x23A5,"MathJax_Size1"], bot: [0x23A6,"MathJax_Size1"], direction:"Vertical"}],
        0x007B: // {
         [[1,"MathJax_Main"],[1.2,"MathJax_Size1"],[1.8,"MathJax_Size2"],[2.4,"MathJax_Size3"],[3.0,"MathJax_Size4"],
          {top: [0x23A7,"MathJax_Size1"], mid:[0x23A8,"MathJax_Size1"], bot: [0x23A9,"MathJax_Size1"], ext: [0x23AA,"MathJax_Size1"], direction:"Vertical"}],
        0x007D: // }
         [[1,"MathJax_Main"],[1.2,"MathJax_Size1"],[1.8,"MathJax_Size2"],[2.4,"MathJax_Size3"],[3.0,"MathJax_Size4"],
          {top: [0x23AB,"MathJax_Size1"], mid:[0x23AC,"MathJax_Size1"], bot: [0x23AD,"MathJax_Size1"], ext: [0x23AA,"MathJax_Size1"], direction:"Vertical"}],
        0x02C6: // wide hat
         [[.267+.05,"MathJax_Main"],[.567+.05,"MathJax_Size1"],[1.005+.05,"MathJax_Size2"],[1.447+.1,"MathJax_Size3"],[1.909+.1,"MathJax_Size4"],{stop:1, direction:"Horizontal"}],
        0x02DC: // wide tilde
         [[.333,"MathJax_Main"],[.555+.05,"MathJax_Size1"],[1+.05,"MathJax_Size2"],[1.443+.1,"MathJax_Size3"],[1.887+.1,"MathJax_Size4"],{stop:1, direction:"Horizontal"}],
        0x0302: // wide hat
         [[.267+.05,"MathJax_Main"],[.567+.05,"MathJax_Size1"],[1.005+.05,"MathJax_Size2"],[1.447+.1,"MathJax_Size3"],[1.909+.1,"MathJax_Size4"],{stop:1, direction:"Horizontal"}],
        0x0303: // wide tilde
         [[.333,"MathJax_Main"],[.555+.05,"MathJax_Size1"],[1+.05,"MathJax_Size2"],[1.443+.1,"MathJax_Size3"],[1.887+.1,"MathJax_Size4"],{stop:1, direction:"Horizontal"}],
        0x2190: // left arrow
         [[.889,"MathJax_Main"],{left:[0x2190,"MathJax_Main"],rep:[0x2212,"MathJax_Main"],direction:"Horizontal"}],
        0x2191: // \uparrow
         [[.888,"MathJax_Main"],{top:[0x2191,"MathJax_Size1"], ext:[0x23D0,"MathJax_Size1"],direction:"Vertical"}],
        0x2192: // right arrow
         [[.889,"MathJax_Main"],{rep:[0x2212,"MathJax_Main"],right:[0x2192,"MathJax_Main"],direction:"Horizontal"}],
        0x2193: // \downarrow
         [[.888,"MathJax_Main"],{ext:[0x23D0,"MathJax_Size1"],bot:[0x2193,"MathJax_Size1"],direction:"Vertical"}],
        0x2194: // left-right arrow
         [[1,"MathJax_Main"],{left:[0x2190,"MathJax_Main"],rep:[0x2212,"MathJax_Main"],right:[0x2192,"MathJax_Main"],direction:"Horizontal"}],
        0x2195: // \updownarrow
         [[1.044,"MathJax_Main"],{top:[0x2191,"MathJax_Size1"], ext:[0x23D0,"MathJax_Size1"],bot:[0x2193,"MathJax_Size1"],direction:"Vertical"}],
        0x21D1: // \Uparrow
         [[.888,"MathJax_Main"],{top:[0x21D1,"MathJax_Size1"], ext:[0x2016,"MathJax_Size1"],direction:"Vertical"}],
        0x21D3: // \Downarrow
         [[.888,"MathJax_Main"],{ext:[0x2016,"MathJax_Size1"],bot:[0x21D3,"MathJax_Size1"],direction:"Vertical"}],
        0x21D5: // \Updownarrow
         [[1.044,"MathJax_Main"],{top:[0x21D1,"MathJax_Size1"], ext:[0x2016,"MathJax_Size1"],bot:[0x21D3,"MathJax_Size1"],direction:"Vertical"}],
        0x2212: // horizontal line
         [[.611,"MathJax_Main"],{rep:[0x2212,"MathJax_Main"], direction:"Horizontal"}],
        0x221A: // \surd
         [[1,"MathJax_Main"],[1.2,"MathJax_Size1"],[1.8,"MathJax_Size2"],[2.4,"MathJax_Size3"],[3,"MathJax_Size4"],
          {top: [0xE001,"MathJax_Size1"], ext: [0xE000,"MathJax_Size1"], bot: [0x23B7,"MathJax_Size1"], direction:"Vertical", fullExtenders:1}],
        0x2223: // \vert
         [[1,"MathJax_Main"],{ext:[0x2223,"MathJax_Main"],direction:"Vertical"}],
        0x2225: // \Vert
         [[1,"MathJax_Main"],{ext:[0x2225,"MathJax_Main"],direction:"Vertical"}],
        0x2308: // \lceil
         [[1,"MathJax_Main"],[1.2,"MathJax_Size1"],[1.8,"MathJax_Size2"],[2.4,"MathJax_Size3"],[3.0,"MathJax_Size4"],
          {top: [0x23A1,"MathJax_Size1"], ext:[0x23A2,"MathJax_Size1"], direction:"Vertical"}],
        0x2309: // \rceil
         [[1,"MathJax_Main"],[1.2,"MathJax_Size1"],[1.8,"MathJax_Size2"],[2.4,"MathJax_Size3"],[3.0,"MathJax_Size4"],
          {top: [0x23A4,"MathJax_Size1"], ext:[0x23A5,"MathJax_Size1"], direction:"Vertical"}],
        0x230A: // \lfloor
         [[1,"MathJax_Main"],[1.2,"MathJax_Size1"],[1.8,"MathJax_Size2"],[2.4,"MathJax_Size3"],[3.0,"MathJax_Size4"],
          {ext:[0x23A2,"MathJax_Size1"], bot: [0x23A3,"MathJax_Size1"], direction:"Vertical"}],
        0x230B: // \rfloor
         [[1,"MathJax_Main"],[1.2,"MathJax_Size1"],[1.8,"MathJax_Size2"],[2.4,"MathJax_Size3"],[3.0,"MathJax_Size4"],
          {ext:[0x23A5,"MathJax_Size1"], bot: [0x23A6,"MathJax_Size1"], direction:"Vertical"}],
        0x23AA: // \bracevert
         [[.32,"MathJax_Size1"],{top:[0x23AA,"MathJax_Size1"], ext:[0x23AA,"MathJax_Size1"],bot:[0x23AA,"MathJax_Size1"],direction:"Vertical"}],
        0x23B0: // \lmoustache
         [{top:[0x23A7,"MathJax_Size1"], ext:[0x23AA,"MathJax_Size1"],bot:[0x23AD,"MathJax_Size1"],direction:"Vertical"}],
        0x23B1: // \rmoustache
         [{top:[0x23AB,"MathJax_Size1"], ext:[0x23AA,"MathJax_Size1"],bot:[0x23A9,"MathJax_Size1"],direction:"Vertical"}],
        0x23DE: // horizontal brace down
         [{left:[0xE150,"MathJax_Size1"],mid:[[0xE153,0xE152],"MathJax_Size1"],right:[0xE151,"MathJax_Size1"],rep:[0xE154,"MathJax_Size1"],direction:"Horizontal"}],
        0x23DF: // horizontal brace up
         [{left:[0xE152,"MathJax_Size1"],mid:[[0xE151,0xE150],"MathJax_Size1"],right:[0xE153,"MathJax_Size1"],rep:[0xE154,"MathJax_Size1"],direction:"Horizontal"}],
        0x27E8: // \langle
         [[1,"MathJax_Main"],[1.2,"MathJax_Size1"],[1.8,"MathJax_Size2"],[2.4,"MathJax_Size3"],[3.0,"MathJax_Size4"],{stop:1, direction:"Vertical"}],
        0x27E9: // \rangle
         [[1,"MathJax_Main"],[1.2,"MathJax_Size1"],[1.8,"MathJax_Size2"],[2.4,"MathJax_Size3"],[3.0,"MathJax_Size4"],{stop:1, direction:"Vertical"}],
        0x27EE: // \lgroup
         [{top:[0x23A7,"MathJax_Size1"], ext:[0x23AA,"MathJax_Size1"],bot:[0x23A9,"MathJax_Size1"],direction:"Vertical"}],
        0x27EF: // \rgroup
         [{top:[0x23AB,"MathJax_Size1"], ext:[0x23AA,"MathJax_Size1"],bot:[0x23AD,"MathJax_Size1"],direction:"Vertical"}]
      }
    }
  });
  
  TEX.Definitions.mathchar0mi.ell  = ['2113',{mathvariant: MML.VARIANT.NORMAL}];
  TEX.Definitions.mathchar0mi.hbar = ['210F',{mathvariant: MML.VARIANT.NORMAL}];

  TEX.Definitions.macros.overline[1]  = "2212";
  TEX.Definitions.macros.underline[1] = "2212";
  
  HTMLCSS.FONTDATA.FONTS['MathJax_Caligraphic'] = {
    directory: 'Caligraphic/Regular',
    family: 'MathJax_Caligraphic',
    testString: "MATHJAX CALIGRAPHIC",
    skew: {
      0x41: 0.194,
      0x42: 0.139,
      0x43: 0.139,
      0x44: 0.0833,
      0x45: 0.111,
      0x46: 0.111,
      0x47: 0.111,
      0x48: 0.111,
      0x49: 0.0278,
      0x4A: 0.167,
      0x4B: 0.0556,
      0x4C: 0.139,
      0x4D: 0.139,
      0x4E: 0.0833,
      0x4F: 0.111,
      0x50: 0.0833,
      0x51: 0.111,
      0x52: 0.0833,
      0x53: 0.139,
      0x54: 0.0278,
      0x55: 0.0833,
      0x56: 0.0278,
      0x57: 0.0833,
      0x58: 0.139,
      0x59: 0.0833,
      0x5A: 0.139
    },
    0x20: [0,0,250,0,0],               //  
    0x30: [452,22,500,39,460],         // 0
    0x31: [454,0,500,86,426],          // 1
    0x32: [453,0,500,44,449],          // 2
    0x33: [452,216,500,41,456],        // 3
    0x34: [464,194,500,27,471],        // 4
    0x35: [453,217,500,50,448],        // 5
    0x36: [666,22,500,42,456],         // 6
    0x37: [463,216,500,54,485],        // 7
    0x38: [666,21,500,43,457],         // 8
    0x39: [453,216,500,42,457],        // 9
    0x41: [728,50,798,30,819],         // A
    0x42: [705,22,657,31,664],         // B
    0x43: [705,25,527,12,533],         // C
    0x44: [684,1,771,19,767],          // D
    0x45: [706,22,528,30,565],         // E
    0x46: [683,32,719,18,829],         // F
    0x47: [704,119,595,43,599],        // G
    0x48: [683,48,845,18,803],         // H
    0x49: [683,1,545,-31,642],         // I
    0x4A: [683,119,678,47,839],        // J
    0x4B: [705,23,762,32,733],         // K
    0x4C: [706,22,690,32,656],         // L
    0x4D: [705,50,1201,28,1137],       // M
    0x4E: [790,50,820,-27,979],        // N
    0x4F: [705,22,796,58,777],         // O
    0x50: [684,57,696,19,733],         // P
    0x51: [706,131,817,114,787],       // Q
    0x52: [683,22,848,19,837],         // R
    0x53: [705,23,606,17,642],         // S
    0x54: [717,69,545,34,834],         // T
    0x55: [684,28,626,-17,687],        // U
    0x56: [683,52,613,25,658],         // V
    0x57: [683,53,988,25,1034],        // W
    0x58: [684,1,713,52,807],          // X
    0x59: [683,143,668,31,714],        // Y
    0x5A: [683,0,725,37,767],          // Z
    0xA0: [0,0,250,0,0]                //  
  };

  HTMLCSS.FONTDATA.FONTS['MathJax_Main-bold'] = {
    directory: 'Main/Bold',
    family: 'MathJax_Main',
    weight: 'bold',
    testString: "MathJax Main",
    skew: {
      0x131: 0.0319,
      0x237: 0.0958,
      0x210F: -0.0319,
      0x2113: 0.128,
      0x2202: 0.0958
    },
    Ranges: [
      [0xA0,0xFF,"Latin1Supplement"],
      [0x100,0x17F,"LatinExtendedA"],
      [0x180,0x24F,"LatinExtendedB"],
      [0x300,0x36F,"CombDiacritMarks"],
      [0x370,0x3FF,"GreekAndCoptic"],
      [0x2000,0x206F,"GeneralPunctuation"],
      [0x20D0,0x20FF,"CombDiactForSymbols"],
      [0x2100,0x214F,"LetterlikeSymbols"],
      [0x2190,0x21FF,"Arrows"],
      [0x2200,0x22FF,"MathOperators"],
      [0x2300,0x23FF,"MiscTechnical"],
      [0x25A0,0x25FF,"GeometricShapes"],
      [0x2600,0x26FF,"MiscSymbols"],
      [0x27C0,0x27EF,"MiscMathSymbolsA"],
      [0x27F0,0x27FF,"SupplementalArrowsA"],
      [0x2A00,0x2AFF,"SuppMathOperators"]
    ],
    0x20: [0,0,250,0,0],               //  
    0x21: [705,-1,350,89,260],         // !
    0x22: [694,-329,603,38,492],       // "
    0x23: [694,193,958,64,893],        // #
    0x24: [750,56,575,64,510],         // $
    0x25: [750,56,958,65,893],         // %
    0x26: [705,11,894,48,836],         // &
    0x27: [694,-329,319,74,261],       // '
    0x28: [751,250,447,103,382],       // (
    0x29: [750,249,447,64,343],        // )
    0x2A: [750,-306,575,73,501],       // *
    0x2B: [633,131,894,64,829],        // +
    0x2C: [171,194,319,74,258],        // ,
    0x2D: [278,-166,383,13,318],       // -
    0x2E: [171,-1,319,74,245],         // .
    0x2F: [750,250,575,63,511],        // /
    0x30: [655,10,575,45,529],         // 0
    0x31: [655,0,575,80,494],          // 1
    0x32: [654,0,575,57,517],          // 2
    0x33: [655,12,575,47,526],         // 3
    0x34: [657,0,575,32,542],          // 4
    0x35: [655,11,575,57,517],         // 5
    0x36: [655,11,575,48,527],         // 6
    0x37: [676,11,575,64,559],         // 7
    0x38: [654,11,575,48,526],         // 8
    0x39: [654,11,575,48,526],         // 9
    0x3A: [444,-1,319,74,245],         // :
    0x3B: [444,194,319,74,248],        // ;
    0x3C: [587,85,894,96,797],         // <
    0x3D: [393,-109,894,64,829],       // =
    0x3E: [587,85,894,95,797],         // >
    0x3F: [700,-1,543,65,478],         // ?
    0x40: [700,6,894,64,829],          // @
    0x41: [698,0,869,40,828],          // A
    0x42: [687,0,818,39,753],          // B
    0x43: [697,11,831,64,767],         // C
    0x44: [687,0,882,39,817],          // D
    0x45: [681,0,756,38,723],          // E
    0x46: [680,0,724,39,675],          // F
    0x47: [697,10,904,64,845],         // G
    0x48: [686,0,900,39,860],          // H
    0x49: [686,0,436,25,410],          // I
    0x4A: [686,11,594,8,527],          // J
    0x4B: [686,0,901,39,852],          // K
    0x4C: [686,0,692,39,643],          // L
    0x4D: [687,0,1092,39,1052],        // M
    0x4E: [687,1,900,39,861],          // N
    0x4F: [696,10,864,64,798],         // O
    0x50: [686,0,786,39,721],          // P
    0x51: [697,193,864,64,806],        // Q
    0x52: [687,11,862,39,858],         // R
    0x53: [697,11,639,63,575],         // S
    0x54: [675,0,800,41,758],          // T
    0x55: [686,12,885,39,845],         // U
    0x56: [686,7,869,25,843],          // V
    0x57: [686,8,1189,24,1164],        // W
    0x58: [686,0,869,33,835],          // X
    0x59: [686,0,869,19,849],          // Y
    0x5A: [687,0,703,64,645],          // Z
    0x5B: [750,250,319,128,293],       // [
    0x5C: [750,250,575,63,511],        // \
    0x5D: [750,250,319,25,190],        // ]
    0x5E: [694,-520,575,126,448],      // ^
    0x5F: [-10,61,575,0,574],          // _
    0x60: [694,-329,319,58,245],       // `
    0x61: [453,6,559,32,558],          // a
    0x62: [694,7,639,29,601],          // b
    0x63: [453,6,511,39,478],          // c
    0x64: [695,6,639,38,609],          // d
    0x65: [453,6,527,32,494],          // e
    0x66: [700,0,351,40,452],          // f
    0x67: [455,201,575,30,558],        // g
    0x68: [694,0,639,37,623],          // h
    0x69: [695,0,319,40,294],          // i
    0x6A: [695,200,351,-71,274],       // j
    0x6B: [694,0,607,29,587],          // k
    0x6C: [694,0,319,40,301],          // l
    0x6D: [451,0,958,37,942],          // m
    0x6E: [450,0,639,37,623],          // n
    0x6F: [452,5,575,32,542],          // o
    0x70: [450,194,639,28,600],        // p
    0x71: [450,194,607,38,609],        // q
    0x72: [450,0,474,29,442],          // r
    0x73: [453,7,454,37,415],          // s
    0x74: [636,6,447,21,382],          // t
    0x75: [450,6,639,37,623],          // u
    0x76: [444,4,607,26,580],          // v
    0x77: [444,5,831,25,805],          // w
    0x78: [444,0,607,21,586],          // x
    0x79: [444,200,607,23,580],        // y
    0x7A: [445,0,511,31,462],          // z
    0x7B: [751,251,575,69,504],        // {
    0x7C: [750,249,319,129,190],       // |
    0x7D: [751,251,575,70,504],        // }
    0x7E: [344,-201,575,96,478],       // ~
    0x393: [680,0,692,39,643],         // Γ
    0x394: [698,0,958,56,901],         // Δ
    0x398: [696,10,894,64,829],        // Θ
    0x39B: [699,0,806,40,765],         // Λ
    0x39E: [675,0,767,48,718],         // Ξ
    0x3A0: [680,0,900,39,860],         // Π
    0x3A3: [686,0,831,63,766],         // Σ
    0x3A5: [697,0,894,64,829],         // Υ
    0x3A6: [686,0,831,64,766],         // Φ
    0x3A8: [686,0,894,64,829],         // Ψ
    0x3A9: [696,1,831,51,780]          // Ω
  };

  HTMLCSS.FONTDATA.FONTS['MathJax_Main-italic'] = {
    directory: 'Main/Italic',
    family: 'MathJax_Main',
    style: 'italic',
    testString: "MathJax Main",
    Ranges: [
      [0xA0,0xFF,"Latin1Supplement"],
      [0x100,0x17F,"LatinExtendedA"],
      [0x180,0x24F,"LatinExtendedB"],
      [0x300,0x36F,"CombDiacritMarks"],
      [0x370,0x3FF,"GreekAndCoptic"],
      [0x2000,0x206F,"GeneralPunctuation"],
      [0x2100,0x214F,"LetterlikeSymbols"]
    ],
    0x20: [0,0,250,0,0],               //  
    0x21: [716,0,307,107,380],         // !
    0x22: [694,-379,514,176,538],      // "
    0x23: [694,194,818,115,828],       // #
    0x25: [751,56,818,144,848],        // %
    0x26: [716,22,767,127,802],        // &
    0x27: [694,-379,307,213,377],      // '
    0x28: [750,250,409,144,517],       // (
    0x29: [750,250,409,17,390],        // )
    0x2A: [751,-320,511,195,584],      // *
    0x2B: [558,57,767,139,753],        // +
    0x2C: [121,194,307,69,233],        // ,
    0x2D: [251,-179,358,84,341],       // -
    0x2E: [121,0,307,107,231],         // .
    0x2F: [750,250,511,19,617],        // /
    0x30: [665,21,511,110,562],        // 0
    0x31: [666,0,511,110,468],         // 1
    0x32: [666,22,511,76,551],         // 2
    0x33: [667,22,511,96,563],         // 3
    0x34: [666,194,511,46,479],        // 4
    0x35: [666,22,511,106,567],        // 5
    0x36: [665,22,511,120,566],        // 6
    0x37: [666,22,511,136,634],        // 7
    0x38: [666,21,511,99,553],         // 8
    0x39: [666,22,511,107,553],        // 9
    0x3A: [431,0,307,107,308],         // :
    0x3B: [431,194,307,70,308],        // ;
    0x3D: [367,-133,767,116,776],      // =
    0x3F: [717,0,511,195,551],         // ?
    0x40: [705,11,767,152,789],        // @
    0x41: [716,1,743,58,696],          // A
    0x42: [683,1,704,57,732],          // B
    0x43: [705,21,716,150,812],        // C
    0x44: [683,1,755,56,775],          // D
    0x45: [681,0,678,54,743],          // E
    0x46: [681,0,653,54,731],          // F
    0x47: [705,22,774,149,812],        // G
    0x48: [683,0,743,54,860],          // H
    0x49: [683,0,386,49,508],          // I
    0x4A: [683,21,525,78,622],         // J
    0x4B: [683,0,769,54,859],          // K
    0x4C: [683,0,627,54,628],          // L
    0x4D: [684,0,897,58,1010],         // M
    0x4E: [684,0,743,54,860],          // N
    0x4F: [704,22,767,149,788],        // O
    0x50: [684,0,678,55,729],          // P
    0x51: [704,194,767,149,788],       // Q
    0x52: [683,22,729,55,723],         // R
    0x53: [706,22,562,74,634],         // S
    0x54: [678,0,716,171,807],         // T
    0x55: [684,22,743,194,860],        // U
    0x56: [683,22,743,205,868],        // V
    0x57: [683,22,999,205,1124],       // W
    0x58: [684,0,743,50,826],          // X
    0x59: [684,0,743,198,875],         // Y
    0x5A: [683,1,613,80,705],          // Z
    0x5B: [751,251,307,73,446],        // [
    0x5D: [751,251,307,-14,359],       // ]
    0x5E: [694,-527,511,260,528],      // ^
    0x5F: [-24,62,511,91,554],         // _
    0x60: [694,-379,307,197,362],      // `
    0x61: [442,11,511,101,543],        // a
    0x62: [694,11,460,108,467],        // b
    0x63: [441,10,460,103,470],        // c
    0x64: [694,11,511,100,567],        // d
    0x65: [442,10,460,107,470],        // e
    0x66: [705,204,307,-23,450],       // f
    0x67: [442,205,460,46,495],        // g
    0x68: [695,11,511,69,544],         // h
    0x69: [656,10,307,75,340],         // i
    0x6A: [656,204,307,-32,364],       // j
    0x6B: [694,11,460,69,499],         // k
    0x6C: [694,11,256,87,312],         // l
    0x6D: [443,11,818,75,851],         // m
    0x6E: [443,11,562,75,595],         // n
    0x6F: [442,11,511,103,517],        // o
    0x70: [442,194,511,5,518],         // p
    0x71: [442,195,460,100,504],       // q
    0x72: [442,11,422,75,484],         // r
    0x73: [442,11,409,76,418],         // s
    0x74: [627,11,332,87,373],         // t
    0x75: [441,11,537,75,570],         // u
    0x76: [443,10,460,75,492],         // v
    0x77: [443,12,664,74,696],         // w
    0x78: [442,11,464,58,513],         // x
    0x79: [441,206,486,75,522],        // y
    0x7A: [442,11,409,54,466],         // z
    0x7E: [318,-208,511,246,571],      // ~
    0xA3: [714,11,769,87,699],         // £
    0x131: [441,10,307,75,340],        // ı
    0x237: [442,205,332,-32,327],      // ȷ
    0x393: [680,0,627,54,706],         // Γ
    0x394: [717,1,818,70,751],         // Δ
    0x398: [704,22,767,149,788],       // Θ
    0x39B: [717,0,692,58,646],         // Λ
    0x39E: [678,1,664,74,754],         // Ξ
    0x3A0: [680,0,743,54,859],         // Π
    0x3A3: [683,1,716,80,782],         // Σ
    0x3A5: [706,0,767,213,833],        // Υ
    0x3A6: [683,1,716,158,728],        // Φ
    0x3A8: [683,0,767,207,824],        // Ψ
    0x3A9: [705,0,716,100,759]         // Ω
  };

  HTMLCSS.FONTDATA.FONTS['MathJax_Main'] = {
    directory: 'Main/Regular',
    family: 'MathJax_Main',
    testString: "MathJax Main",
    skew: {
      0x131: 0.0278,
      0x237: 0.0833,
      0x2113: 0.111,
      0x2118: 0.111,
      0x2202: 0.0833
    },
    Ranges: [
      [0xA0,0xFF,"Latin1Supplement"],
      [0x100,0x17F,"LatinExtendedA"],
      [0x180,0x24F,"LatinExtendedB"],
      [0x300,0x36F,"CombDiacritMarks"],
      [0x370,0x3FF,"GreekAndCoptic"],
      [0x2000,0x206F,"GeneralPunctuation"],
      [0x20D0,0x20FF,"CombDiactForSymbols"],
      [0x2100,0x214F,"LetterlikeSymbols"],
      [0x2190,0x21FF,"Arrows"],
      [0x2200,0x22FF,"MathOperators"],
      [0x2300,0x23FF,"MiscTechnical"],
      [0x25A0,0x25FF,"GeometricShapes"],
      [0x2600,0x26FF,"MiscSymbols"],
      [0x27C0,0x27EF,"MiscMathSymbolsA"],
      [0x27F0,0x27FF,"SupplementalArrowsA"],
      [0x2A00,0x2AFF,"SuppMathOperators"]
    ],
    0x20: [0,0,250,0,0],               //  
    0x21: [716,-1,278,78,199],         // !
    0x22: [694,-379,500,34,372],       // "
    0x23: [694,194,833,55,778],        // #
    0x24: [750,56,500,54,444],         // $
    0x25: [750,56,833,56,776],         // %
    0x26: [717,22,778,42,727],         // &
    0x27: [694,-379,278,78,212],       // '
    0x28: [751,251,389,94,333],        // (
    0x29: [750,250,389,55,294],        // )
    0x2A: [750,-319,500,64,435],       // *
    0x2B: [583,83,778,55,722],         // +
    0x2C: [121,194,278,78,210],        // ,
    0x2D: [252,-179,333,11,277],       // -
    0x2E: [120,0,278,78,199],          // .
    0x2F: [751,250,500,56,445],        // /
    0x30: [666,22,500,39,460],         // 0
    0x31: [666,0,500,83,427],          // 1
    0x32: [666,1,500,49,449],          // 2
    0x33: [665,23,500,41,457],         // 3
    0x34: [677,0,500,28,471],          // 4
    0x35: [666,22,500,49,449],         // 5
    0x36: [666,22,500,42,456],         // 6
    0x37: [676,22,500,55,485],         // 7
    0x38: [666,22,500,43,457],         // 8
    0x39: [666,22,500,41,456],         // 9
    0x3A: [430,0,278,78,199],          // :
    0x3B: [430,194,278,78,202],        // ;
    0x3C: [540,40,778,83,694],         // <
    0x3D: [367,-133,778,55,722],       // =
    0x3E: [540,40,778,82,694],         // >
    0x3F: [706,-1,472,55,416],         // ?
    0x40: [705,11,778,56,722],         // @
    0x41: [717,0,750,32,717],          // A
    0x42: [684,0,708,28,651],          // B
    0x43: [706,21,722,56,666],         // C
    0x44: [683,0,764,27,708],          // D
    0x45: [680,0,681,24,652],          // E
    0x46: [680,0,653,25,611],          // F
    0x47: [706,22,785,56,735],         // G
    0x48: [683,0,750,25,724],          // H
    0x49: [683,0,361,21,339],          // I
    0x4A: [683,22,514,25,465],         // J
    0x4B: [683,0,778,24,736],          // K
    0x4C: [683,0,625,25,582],          // L
    0x4D: [683,0,917,29,887],          // M
    0x4E: [683,0,750,25,724],          // N
    0x4F: [705,22,778,56,722],         // O
    0x50: [684,0,681,27,624],          // P
    0x51: [705,193,778,56,728],        // Q
    0x52: [684,22,736,27,732],         // R
    0x53: [706,23,556,55,500],         // S
    0x54: [677,0,722,36,685],          // T
    0x55: [684,22,750,25,724],         // U
    0x56: [683,23,750,19,730],         // V
    0x57: [683,23,1028,18,1009],       // W
    0x58: [683,1,750,23,727],          // X
    0x59: [684,0,750,11,738],          // Y
    0x5A: [683,1,611,55,560],          // Z
    0x5B: [750,250,278,118,255],       // [
    0x5C: [750,250,500,56,444],        // \
    0x5D: [750,250,278,22,159],        // ]
    0x5E: [694,-531,500,112,387],      // ^
    0x5F: [-25,62,500,0,499],          // _
    0x60: [694,-379,278,64,198],       // `
    0x61: [448,11,500,34,493],         // a
    0x62: [694,11,556,20,522],         // b
    0x63: [448,11,444,34,415],         // c
    0x64: [694,11,556,34,535],         // d
    0x65: [448,11,444,28,415],         // e
    0x66: [705,0,306,25,372],          // f
    0x67: [453,206,500,29,485],        // g
    0x68: [695,0,556,25,543],          // h
    0x69: [669,0,278,26,255],          // i
    0x6A: [669,205,306,-55,218],       // j
    0x6B: [695,0,528,20,512],          // k
    0x6C: [694,0,278,26,263],          // l
    0x6D: [443,0,833,25,820],          // m
    0x6E: [443,0,556,25,543],          // n
    0x6F: [448,10,500,28,471],         // o
    0x70: [443,194,556,20,522],        // p
    0x71: [442,194,528,33,535],        // q
    0x72: [442,0,392,20,364],          // r
    0x73: [449,12,394,32,359],         // s
    0x74: [615,10,389,18,334],         // t
    0x75: [442,11,556,25,542],         // u
    0x76: [431,11,528,19,508],         // v
    0x77: [432,12,722,18,704],         // w
    0x78: [431,0,528,10,516],          // x
    0x79: [431,204,528,19,508],        // y
    0x7A: [431,0,444,28,401],          // z
    0x7B: [750,250,500,64,434],        // {
    0x7C: [750,250,278,119,159],       // |
    0x7D: [750,250,500,64,435],        // }
    0x7E: [318,-215,500,83,416],       // ~
    0xA0: [0,0,250,0,0],               //  
    0xAC: [356,-89,667,55,611],        // ¬
    0xB1: [666,0,778,55,722],          // ±
    0xD7: [491,-9,778,147,631],        // ×
    0xF7: [537,36,778,55,721],         // ÷
    0x131: [442,0,278,26,255],         // ı
    0x237: [442,205,306,-55,218],      // ȷ
    0x300: [699,-505,0,106,295],       // ̀
    0x301: [699,-505,0,203,393],       // ́
    0x302: [694,-531,0,112,387],       // ̂
    0x303: [668,-565,0,83,416],        // ̃
    0x304: [590,-544,0,69,430],        // ̄
    0x306: [694,-515,0,92,407],        // ̆
    0x307: [669,-549,0,190,309],       // ̇
    0x308: [669,-554,0,95,404],        // ̈
    0x30A: [715,-542,0,147,352],       // ̊
    0x30B: [701,-510,0,122,420],       // ̋
    0x30C: [644,-513,0,114,385],       // ̌
    0x338: [716,215,0,139,638],        // ̸
    0x393: [681,0,625,25,582],         // Γ
    0x394: [716,0,833,46,786],         // Δ
    0x398: [705,22,778,56,722],        // Θ
    0x39B: [717,0,694,32,661],         // Λ
    0x39E: [677,0,667,42,624],         // Ξ
    0x3A0: [680,0,750,25,724],         // Π
    0x3A3: [683,1,722,55,666],         // Σ
    0x3A5: [705,0,778,55,722],         // Υ
    0x3A6: [683,0,722,56,665],         // Φ
    0x3A8: [683,0,778,54,722],         // Ψ
    0x3A9: [704,1,722,44,677],         // Ω
    0x2006: [0,0,167,0,0],             //  
    0x2013: [285,-248,500,0,499],      // –
    0x2014: [285,-248,1000,0,999],     // —
    0x2018: [694,-379,278,64,198],     // ‘
    0x2019: [694,-379,278,78,212],     // ’
    0x201C: [694,-379,500,128,466],    // “
    0x201D: [694,-379,500,34,372],     // ”
    0x2020: [705,217,444,55,390],      // †
    0x2021: [705,206,444,55,389],      // ‡
    0x2026: [120,0,1172,78,1093],      // …
    0x2032: [560,-43,275,30,262],      // ′
    0x20D7: [714,-516,0,29,471],       // ⃗
    0x210F: [695,13,540,42,562],       // ℏ
    0x2111: [705,11,722,54,693],       // ℑ
    0x2113: [706,20,417,6,398],        // ℓ
    0x2118: [453,216,636,67,625],      // ℘
    0x211C: [717,22,722,40,716],       // ℜ
    0x2135: [694,1,611,54,556],        // ℵ
    0x2190: [511,12,1000,54,944],      // ←
    0x2191: [694,194,500,17,483],      // ↑
    0x2192: [512,11,1000,55,945],      // →
    0x2193: [694,194,500,17,483],      // ↓
    0x2194: [511,11,1000,55,945],      // ↔
    0x2195: [772,272,500,17,483],      // ↕
    0x2196: [720,196,1000,29,944],     // ↖
    0x2197: [720,195,1000,55,970],     // ↗
    0x2198: [695,220,1000,55,970],     // ↘
    0x2199: [695,220,1000,29,944],     // ↙
    0x21A6: [512,11,1000,54,945],      // ↦
    0x21A9: [511,12,1126,54,1070],     // ↩
    0x21AA: [512,11,1126,55,1071],     // ↪
    0x21BC: [511,-230,1000,55,944],    // ↼
    0x21BD: [270,11,1000,55,944],      // ↽
    0x21C0: [511,-230,1000,55,944],    // ⇀
    0x21C1: [270,11,1000,55,945],      // ⇁
    0x21CC: [671,11,1000,55,944],      // ⇌
    0x21D0: [525,24,1000,55,944],      // ⇐
    0x21D1: [694,194,611,31,579],      // ⇑
    0x21D2: [525,25,1000,55,944],      // ⇒
    0x21D3: [694,194,611,31,579],      // ⇓
    0x21D4: [525,25,1000,34,966],      // ⇔
    0x21D5: [772,272,611,31,580],      // ⇕
    0x2200: [694,22,556,0,556],        // ∀
    0x2202: [715,22,531,41,566],       // ∂
    0x2203: [694,0,556,55,500],        // ∃
    0x2205: [772,78,500,39,460],       // ∅
    0x2207: [683,33,833,46,786],       // ∇
    0x2208: [541,41,667,84,584],       // ∈
    0x2209: [716,215,667,84,584],      // ∉
    0x220B: [541,40,667,83,582],       // ∋
    0x2212: [270,-230,778,83,694],     // −
    0x2213: [500,167,778,55,722],      // ∓
    0x2215: [751,250,500,56,445],      // ∕
    0x2216: [750,250,500,56,444],      // ∖
    0x2217: [465,-34,500,64,435],      // ∗
    0x2218: [444,-55,500,55,444],      // ∘
    0x2219: [444,-55,500,55,444],      // ∙
    0x221A: [800,200,833,72,853],      // √
    0x221D: [442,11,778,56,722],       // ∝
    0x221E: [442,11,1000,55,944],      // ∞
    0x2220: [694,0,722,55,666],        // ∠
    0x2223: [750,250,278,119,159],     // ∣
    0x2225: [750,250,500,132,367],     // ∥
    0x2227: [598,22,667,55,611],       // ∧
    0x2228: [598,22,667,55,611],       // ∨
    0x2229: [598,22,667,55,611],       // ∩
    0x222A: [599,22,667,55,611],       // ∪
    0x222B: [716,216,417,55,472],      // ∫
    0x223C: [367,-133,778,55,722],     // ∼
    0x2240: [583,83,278,55,222],       // ≀
    0x2243: [464,-36,778,55,722],      // ≃
    0x2245: [589,-22,1000,55,722],     // ≅
    0x2248: [483,-55,778,55,722],      // ≈
    0x224D: [484,-16,778,55,722],      // ≍
    0x2250: [670,-133,778,55,722],     // ≐
    0x2260: [716,215,778,55,722],      // ≠
    0x2261: [464,-36,778,55,722],      // ≡
    0x2264: [636,138,778,83,694],      // ≤
    0x2265: [636,138,778,82,694],      // ≥
    0x226A: [568,68,1000,56,944],      // ≪
    0x226B: [567,67,1000,55,945],      // ≫
    0x227A: [539,41,778,84,695],       // ≺
    0x227B: [539,41,778,83,694],       // ≻
    0x2282: [540,41,778,84,695],       // ⊂
    0x2283: [541,40,778,82,693],       // ⊃
    0x2286: [636,139,778,84,695],      // ⊆
    0x2287: [637,138,778,83,693],      // ⊇
    0x228E: [599,22,667,55,611],       // ⊎
    0x2291: [636,138,778,83,714],      // ⊑
    0x2292: [636,138,778,63,694],      // ⊒
    0x2293: [598,0,667,61,605],        // ⊓
    0x2294: [598,0,667,61,605],        // ⊔
    0x2295: [583,83,778,56,722],       // ⊕
    0x2296: [583,83,778,56,722],       // ⊖
    0x2297: [583,83,778,56,722],       // ⊗
    0x2298: [583,83,778,56,722],       // ⊘
    0x2299: [583,83,778,56,722],       // ⊙
    0x22A2: [694,0,611,55,555],        // ⊢
    0x22A3: [694,0,611,55,555],        // ⊣
    0x22A4: [668,0,778,55,723],        // ⊤
    0x22A5: [668,0,778,55,723],        // ⊥
    0x22A8: [750,250,867,119,811],     // ⊨
    0x22C4: [488,-12,500,12,488],      // ⋄
    0x22C5: [310,-190,278,78,199],     // ⋅
    0x22C6: [486,-16,500,3,497],       // ⋆
    0x22C8: [505,6,900,25,873],        // ⋈
    0x22EE: [900,30,278,78,199],       // ⋮
    0x22EF: [310,-190,1172,78,1093],   // ⋯
    0x22F1: [820,-100,1282,133,1148],  // ⋱
    0x2308: [751,250,444,174,422],     // ⌈
    0x2309: [751,250,444,21,269],      // ⌉
    0x230A: [750,251,444,174,422],     // ⌊
    0x230B: [751,251,444,20,269],      // ⌋
    0x2322: [388,-122,1000,55,944],    // ⌢
    0x2323: [378,-134,1000,55,944],    // ⌣
    0x23B0: [743,241,512,56,456],      // ⎰
    0x23B1: [743,242,512,56,457],      // ⎱
    0x25B3: [716,0,889,59,828],        // △
    0x25B9: [505,5,500,26,474],        // ▹
    0x25BD: [500,215,889,59,828],      // ▽
    0x25C3: [505,5,500,26,473],        // ◃
    0x25EF: [715,215,1000,56,944],     // ◯
    0x2660: [727,131,778,55,723],      // ♠
    0x2661: [716,33,778,55,723],       // ♡
    0x2662: [727,163,778,55,723],      // ♢
    0x2663: [726,131,778,28,750],      // ♣
    0x266D: [751,22,389,54,333],       // ♭
    0x266E: [734,223,389,65,324],      // ♮
    0x266F: [723,223,389,54,334],      // ♯
    0x27E8: [750,250,389,110,333],     // ⟨
    0x27E9: [750,250,389,55,278],      // ⟩
    0x27EE: [743,242,400,100,344],     // ⟮
    0x27EF: [743,241,400,56,301],      // ⟯
    0x27F5: [511,12,1609,54,1525],     // ⟵
    0x27F6: [512,11,1638,83,1554],     // ⟶
    0x27F7: [512,12,1859,54,1804],     // ⟷
    0x27F8: [525,24,1609,55,1553],     // ⟸
    0x27F9: [525,25,1638,55,1582],     // ⟹
    0x27FA: [525,24,1858,55,1802],     // ⟺
    0x27FC: [512,11,1638,54,1554],     // ⟼
    0x2A3F: [684,0,750,28,721],        // ⨿
    0x2AAF: [636,138,778,83,695],      // ⪯
    0x2AB0: [636,138,778,83,694]       // ⪰
  };

  HTMLCSS.FONTDATA.FONTS['MathJax_Math-italic'] = {
    directory: 'Math/Italic',
    family: 'MathJax_Math',
    style: 'italic',
    testString: "MathJax Math",
    skew: {
      0x41: 0.139,
      0x42: 0.0833,
      0x43: 0.0833,
      0x44: 0.0556,
      0x45: 0.0833,
      0x46: 0.0833,
      0x47: 0.0833,
      0x48: 0.0556,
      0x49: 0.111,
      0x4A: 0.167,
      0x4B: 0.0556,
      0x4C: 0.0278,
      0x4D: 0.0833,
      0x4E: 0.0833,
      0x4F: 0.0833,
      0x50: 0.0833,
      0x51: 0.0833,
      0x52: 0.0833,
      0x53: 0.0833,
      0x54: 0.0833,
      0x55: 0.0278,
      0x58: 0.0833,
      0x5A: 0.0833,
      0x63: 0.0556,
      0x64: 0.167,
      0x65: 0.0556,
      0x66: 0.167,
      0x67: 0.0278,
      0x68: -0.0278,
      0x6C: 0.0833,
      0x6F: 0.0556,
      0x70: 0.0833,
      0x71: 0.0833,
      0x72: 0.0556,
      0x73: 0.0556,
      0x74: 0.0833,
      0x75: 0.0278,
      0x76: 0.0278,
      0x77: 0.0833,
      0x78: 0.0278,
      0x79: 0.0556,
      0x7A: 0.0556,
      0x393: 0.0833,
      0x394: 0.167,
      0x398: 0.0833,
      0x39B: 0.167,
      0x39E: 0.0833,
      0x3A0: 0.0556,
      0x3A3: 0.0833,
      0x3A5: 0.0556,
      0x3A6: 0.0833,
      0x3A8: 0.0556,
      0x3A9: 0.0833,
      0x3B1: 0.0278,
      0x3B2: 0.0833,
      0x3B4: 0.0556,
      0x3B5: 0.0833,
      0x3B6: 0.0833,
      0x3B7: 0.0556,
      0x3B8: 0.0833,
      0x3B9: 0.0556,
      0x3BC: 0.0278,
      0x3BD: 0.0278,
      0x3BE: 0.111,
      0x3BF: 0.0556,
      0x3C1: 0.0833,
      0x3C2: 0.0833,
      0x3C4: 0.0278,
      0x3C5: 0.0278,
      0x3C6: 0.0833,
      0x3C7: 0.0556,
      0x3C8: 0.111,
      0x3D1: 0.0833,
      0x3D5: 0.0833,
      0x3F1: 0.0833,
      0x3F5: 0.0556
    },
    0x20: [0,0,250,0,0],               //  
    0x41: [717,0,750,35,727],          // A
    0x42: [683,0,759,35,756],          // B
    0x43: [705,22,715,50,760],         // C
    0x44: [683,1,828,32,804],          // D
    0x45: [680,1,738,30,764],          // E
    0x46: [681,0,643,30,749],          // F
    0x47: [705,22,786,50,760],         // G
    0x48: [683,0,831,31,889],          // H
    0x49: [684,0,440,26,504],          // I
    0x4A: [683,22,555,57,633],         // J
    0x4B: [684,0,849,31,889],          // K
    0x4C: [684,1,681,32,647],          // L
    0x4D: [684,0,970,35,1051],         // M
    0x4E: [684,0,803,31,888],          // N
    0x4F: [704,22,763,50,740],         // O
    0x50: [683,0,642,33,751],          // P
    0x51: [704,195,791,50,740],        // Q
    0x52: [683,22,759,33,755],         // R
    0x53: [705,22,613,52,645],         // S
    0x54: [678,0,584,21,705],          // T
    0x55: [684,22,683,59,767],         // U
    0x56: [683,23,583,52,769],         // V
    0x57: [684,22,944,51,1048],        // W
    0x58: [684,1,828,25,852],          // X
    0x59: [683,-1,581,29,763],         // Y
    0x5A: [684,1,683,58,724],          // Z
    0x61: [441,10,529,33,506],         // a
    0x62: [694,11,429,39,422],         // b
    0x63: [442,11,433,34,429],         // c
    0x64: [694,10,520,33,524],         // d
    0x65: [442,11,466,39,429],         // e
    0x66: [705,205,490,55,550],        // f
    0x67: [443,205,477,10,480],        // g
    0x68: [694,11,576,48,555],         // h
    0x69: [661,11,345,21,303],         // i
    0x6A: [661,204,412,-12,403],       // j
    0x6B: [694,11,521,48,503],         // k
    0x6C: [694,11,298,38,267],         // l
    0x6D: [442,11,878,21,857],         // m
    0x6E: [442,11,600,21,580],         // n
    0x6F: [441,11,485,34,476],         // o
    0x70: [442,194,503,-39,497],       // p
    0x71: [442,194,446,33,460],        // q
    0x72: [442,11,451,21,430],         // r
    0x73: [442,10,469,53,419],         // s
    0x74: [626,11,361,19,330],         // t
    0x75: [442,11,572,21,551],         // u
    0x76: [443,11,485,21,467],         // v
    0x77: [444,11,716,20,690],         // w
    0x78: [443,11,572,35,523],         // x
    0x79: [442,205,490,21,496],        // y
    0x7A: [442,12,465,35,468],         // z
    0xA0: [0,0,250,0,0],               //  
    0x393: [680,-1,615,31,721],        // Γ
    0x394: [716,1,833,48,788],         // Δ
    0x398: [704,22,763,50,740],        // Θ
    0x39B: [717,0,694,35,671],         // Λ
    0x39E: [678,1,742,53,777],         // Ξ
    0x3A0: [681,0,831,31,888],         // Π
    0x3A3: [683,0,780,58,806],         // Σ
    0x3A5: [706,0,583,28,701],         // Υ
    0x3A6: [683,0,667,24,643],         // Φ
    0x3A8: [684,0,612,21,693],         // Ψ
    0x3A9: [704,0,772,80,786],         // Ω
    0x3B1: [442,11,640,34,603],        // α
    0x3B2: [706,194,566,23,573],       // β
    0x3B3: [441,216,518,11,543],       // γ
    0x3B4: [717,10,444,36,451],        // δ
    0x3B5: [453,22,466,27,428],        // ε
    0x3B6: [704,204,438,44,472],       // ζ
    0x3B7: [442,216,497,21,504],       // η
    0x3B8: [705,10,469,35,462],        // θ
    0x3B9: [442,10,354,48,332],        // ι
    0x3BA: [442,11,576,49,554],        // κ
    0x3BB: [694,12,583,46,556],        // λ
    0x3BC: [443,216,603,22,580],       // μ
    0x3BD: [442,2,494,45,530],         // ν
    0x3BE: [704,205,438,21,443],       // ξ
    0x3BF: [441,11,485,34,476],        // ο
    0x3C0: [431,11,570,19,573],        // π
    0x3C1: [442,216,517,22,510],       // ρ
    0x3C2: [442,108,363,31,405],       // ς
    0x3C3: [431,11,571,31,572],        // σ
    0x3C4: [431,13,437,17,517],        // τ
    0x3C5: [443,10,540,21,523],        // υ
    0x3C6: [442,219,654,50,618],       // φ
    0x3C7: [442,204,626,24,601],       // χ
    0x3C8: [694,205,651,21,634],       // ψ
    0x3C9: [444,11,622,15,604],        // ω
    0x3D1: [705,11,591,21,563],        // ϑ
    0x3D5: [695,206,596,43,579],       // ϕ
    0x3D6: [431,10,828,19,823],        // ϖ
    0x3F1: [442,194,517,67,510],       // ϱ
    0x3F5: [432,11,406,39,383]         // ϵ
  };

  HTMLCSS.FONTDATA.FONTS['MathJax_Size1'] = {
    directory: 'Size1/Regular',
    family: 'MathJax_Size1',
    testString: "() [] {}",
    0x20: [0,0,250,0,0],               //  
    0x28: [40,1159,458,152,422],       // (
    0x29: [41,1159,458,35,305],        // )
    0x2F: [40,1159,578,55,522],        // /
    0x5B: [40,1159,417,202,394],       // [
    0x5C: [40,1159,578,54,522],        // \
    0x5D: [40,1159,417,22,214],        // ]
    0x7B: [40,1159,583,104,477],       // {
    0x7D: [41,1159,583,104,477],       // }
    0xA0: [0,0,250,0,0],               //  
    0x302: [744,-551,0,-8,564],        // ̂
    0x303: [722,-597,0,1,554],         // ̃
    0x2016: [1,601,778,257,521],       // ‖
    0x2191: [0,600,667,112,555],       // ↑
    0x2193: [0,600,667,112,555],       // ↓
    0x21D1: [-1,600,778,57,721],       // ⇑
    0x21D3: [0,599,778,57,721],        // ⇓
    0x220F: [0,1000,944,55,888],       // ∏
    0x2210: [0,1000,944,55,888],       // ∐
    0x2211: [1,1000,1056,56,999],      // ∑
    0x221A: [40,1160,1000,111,1020],   // √
    0x2223: [21,621,333,145,188],      // ∣
    0x2225: [21,621,556,145,410],      // ∥
    0x222B: [0,1111,472,55,610],       // ∫
    0x222E: [0,1111,472,55,610],       // ∮
    0x22C0: [0,999,833,55,777],        // ⋀
    0x22C1: [0,999,833,55,777],        // ⋁
    0x22C2: [0,1000,833,55,777],       // ⋂
    0x22C3: [0,999,833,54,777],        // ⋃
    0x2308: [40,1159,472,202,449],     // ⌈
    0x2309: [40,1159,472,22,269],      // ⌉
    0x230A: [40,1159,472,202,449],     // ⌊
    0x230B: [40,1159,472,22,269],      // ⌋
    0x239B: [40,1770,875,291,843],     // ⎛
    0x239C: [10,610,875,291,417],      // ⎜
    0x239D: [50,1759,875,291,843],     // ⎝
    0x239E: [40,1770,875,31,583],      // ⎞
    0x239F: [10,610,875,457,583],      // ⎟
    0x23A0: [50,1760,875,31,583],      // ⎠
    0x23A1: [39,1760,667,319,666],     // ⎡
    0x23A2: [1,601,667,319,403],       // ⎢
    0x23A3: [40,1759,667,319,666],     // ⎣
    0x23A4: [39,1760,667,0,347],       // ⎤
    0x23A5: [1,601,667,263,347],       // ⎥
    0x23A6: [40,1759,667,0,347],       // ⎦
    0x23A7: [-1,910,889,383,719],      // ⎧
    0x23A8: [11,1810,889,170,505],     // ⎨
    0x23A9: [10,899,889,384,718],      // ⎩
    0x23AA: [10,310,889,383,504],      // ⎪
    0x23AB: [0,911,889,170,504],       // ⎫
    0x23AC: [10,1810,889,384,718],     // ⎬
    0x23AD: [10,899,889,170,505],      // ⎭
    0x23B7: [20,1800,1056,111,742],    // ⎷
    0x23D0: [1,601,667,312,355],       // ⏐
    0x27E8: [40,1160,472,97,394],      // ⟨
    0x27E9: [40,1160,472,77,374],      // ⟩
    0x2A00: [0,1000,1111,56,1054],     // ⨀
    0x2A01: [0,1000,1111,56,1054],     // ⨁
    0x2A02: [0,1000,1111,56,1054],     // ⨂
    0x2A04: [0,1000,833,55,777],       // ⨄
    0x2A06: [0,999,833,55,777],        // ⨆
    0xE000: [20,620,1056,702,742],     // 
    0xE001: [40,580,1056,702,1076],    // 
    0xE150: [120,213,450,-24,461],     // 
    0xE151: [120,214,450,-11,475],     // 
    0xE152: [333,0,450,-24,461],       // 
    0xE153: [333,0,450,-11,475],       // 
    0xE154: [120,0,400,-10,410]        // 
  };

  HTMLCSS.FONTDATA.FONTS['MathJax_Size2'] = {
    directory: 'Size2/Regular',
    family: 'MathJax_Size2',
    testString: "() [] {}",
    0x20: [0,0,250,0,0],               //  
    0x28: [40,1759,597,180,561],       // (
    0x29: [41,1759,597,35,416],        // )
    0x2F: [40,1759,811,55,755],        // /
    0x5B: [40,1759,472,224,455],       // [
    0x5C: [40,1759,811,54,754],        // \
    0x5D: [40,1759,472,16,247],        // ]
    0x7B: [40,1759,667,119,547],       // {
    0x7D: [41,1759,667,119,547],       // }
    0xA0: [0,0,250,0,0],               //  
    0x302: [772,-565,0,-5,1004],       // ̂
    0x303: [750,-611,0,0,999],         // ̃
    0x220F: [0,1400,1278,56,1221],     // ∏
    0x2210: [0,1400,1278,56,1221],     // ∐
    0x2211: [0,1400,1444,55,1388],     // ∑
    0x221A: [40,1760,1000,111,1020],   // √
    0x222B: [0,2222,556,55,944],       // ∫
    0x222E: [0,2222,556,55,944],       // ∮
    0x22C0: [0,1400,1111,55,1055],     // ⋀
    0x22C1: [0,1400,1111,55,1055],     // ⋁
    0x22C2: [0,1399,1111,55,1055],     // ⋂
    0x22C3: [-1,1400,1111,55,1055],    // ⋃
    0x2308: [40,1759,528,224,511],     // ⌈
    0x2309: [40,1759,528,16,303],      // ⌉
    0x230A: [40,1759,528,224,511],     // ⌊
    0x230B: [40,1759,528,16,303],      // ⌋
    0x27E8: [40,1759,611,112,524],     // ⟨
    0x27E9: [40,1759,611,85,498],      // ⟩
    0x2A00: [-1,1399,1511,56,1454],    // ⨀
    0x2A01: [-1,1399,1511,56,1454],    // ⨁
    0x2A02: [-1,1399,1511,56,1454],    // ⨂
    0x2A04: [0,1399,1111,55,1055],     // ⨄
    0x2A06: [0,1400,1111,55,1055]      // ⨆
  };

  HTMLCSS.FONTDATA.FONTS['MathJax_Size3'] = {
    directory: 'Size3/Regular',
    family: 'MathJax_Size3',
    testString: "() [] {}",
    0x20: [0,0,250,0,0],               //  
    0x28: [40,2359,736,209,701],       // (
    0x29: [41,2359,736,34,526],        // )
    0x2F: [40,2359,1044,55,989],       // /
    0x5B: [40,2359,528,247,516],       // [
    0x5C: [40,2359,1044,56,988],       // \
    0x5D: [40,2359,528,11,280],        // ]
    0x7B: [40,2359,750,130,618],       // {
    0x7D: [41,2359,750,131,618],       // }
    0xA0: [0,0,250,0,0],               //  
    0x302: [772,-564,0,-4,1447],       // ̂
    0x303: [749,-610,0,1,1442],        // ̃
    0x221A: [40,2361,1000,111,1020],   // √
    0x2308: [40,2359,583,246,571],     // ⌈
    0x2309: [40,2359,583,11,336],      // ⌉
    0x230A: [40,2359,583,246,571],     // ⌊
    0x230B: [40,2359,583,11,336],      // ⌋
    0x27E8: [40,2360,750,126,654],     // ⟨
    0x27E9: [40,2360,750,94,623]       // ⟩
  };

  HTMLCSS.FONTDATA.FONTS['MathJax_Size4'] = {
    directory: 'Size4/Regular',
    family: 'MathJax_Size4',
    testString: "() [] {}",
    0x20: [0,0,250,0,0],               //  
    0x28: [40,2959,792,237,758],       // (
    0x29: [41,2960,792,33,554],        // )
    0x2F: [40,2959,1278,56,1221],      // /
    0x5B: [40,2959,583,269,577],       // [
    0x5C: [40,2959,1278,56,1221],      // \
    0x5D: [40,2959,583,5,313],         // ]
    0x7B: [40,2960,806,144,662],       // {
    0x7D: [41,2959,806,144,662],       // }
    0xA0: [0,0,250,0,0],               //  
    0x302: [845,-561,0,-14,1902],      // ̂
    0x303: [823,-583,0,1,1885],        // ̃
    0x221A: [40,2961,1000,111,1020],   // √
    0x2308: [40,2959,639,269,633],     // ⌈
    0x2309: [40,2959,639,5,369],       // ⌉
    0x230A: [40,2959,639,269,633],     // ⌊
    0x230B: [40,2959,639,5,369],       // ⌋
    0x27E8: [40,2959,806,140,703],     // ⟨
    0x27E9: [41,2959,806,103,665]      // ⟩
  };

  HTMLCSS.FONTDATA.FONTS['MathJax_Main'][0x22EE][0] += 400;  // adjust height for \vdots
  HTMLCSS.FONTDATA.FONTS['MathJax_Main'][0x22F1][0] += 700;  // adjust height for \ddots
  HTMLCSS.FONTDATA.FONTS['MathJax_Size1'][0xE154][0] += 200;  // adjust height for brace extender
  HTMLCSS.FONTDATA.FONTS['MathJax_Size1'][0xE154][1] += 200;  // adjust depth for brace extender

  if (!HTMLCSS.imgFonts) {
    MathJax.Hub.Browser.Select({
      MSIE: function (browser) {
        
        if (!HTMLCSS.imgFonts && HTMLCSS.config.availableFonts && HTMLCSS.config.availableFonts.length) {
          var testString = HTMLCSS.msieCheckGreek =
            String.fromCharCode(0x393)+" "+String.fromCharCode(0x3A5)+" "+String.fromCharCode(0x39B);

          HTMLCSS.FONTDATA.RANGES.push({name: "greek", low: 0x03B1, high: 0x03C9, offset: "G", add: 32});
          HTMLCSS.FONTDATA.RANGES.push({name: "Greek", low: 0x0391, high: 0x03F6, offset: "G"});
          
          if (HTMLCSS.Font.testFont({family:"MathJax_Greek", testString: testString})) {
            HTMLCSS.Augment({
              FONTDATA: {
                VARIANT: {
                  normal:             {offsetG: 0x391, variantG: "-Greek"},
                  "fraktur":          {offsetG: 0x391, variantG: "-Greek"},
                  "script":           {offsetG: 0x391, variantG: "-Greek"},
                  "-tex-caligraphic": {offsetG: 0x391, variantG: "-Greek"},
                  "-tex-oldstyle":    {offsetG: 0x391, variantG: "-Greek"},
                  "-Greek":           {fonts:["MathJax_Greek"]}
                }
              }
            });

            HTMLCSS.FONTDATA.FONTS['MathJax_Greek'] = {
              directory: 'Greek/Regular',
              family: 'MathJax_Greek',
              testString: String.fromCharCode(0x393)+" "+String.fromCharCode(0x3A5)+" "+String.fromCharCode(0x39B),
              0x20: [0,0,250,0,0],               //  
              0xA0: [0,0,250,0,0],               //  
              0x393: [680,0,625,25,582],         // Γ
              0x394: [716,0,833,46,786],         // Δ
              0x398: [705,22,778,56,722],        // Θ
              0x39B: [716,0,694,32,661],         // Λ
              0x39E: [677,0,667,42,624],         // Ξ
              0x3A0: [680,0,750,25,724],         // Π
              0x3A3: [683,0,722,55,666],         // Σ
              0x3A5: [705,0,778,55,722],         // Υ
              0x3A6: [683,0,722,56,665],         // Φ
              0x3A8: [683,0,778,55,722],         // Ψ
              0x3A9: [704,0,722,44,677]          // Ω
            };
          }
          
          if (HTMLCSS.Font.testFont({family:"MathJax_Greek", weight:"bold", testString: testString})) {
            HTMLCSS.Augment({
              FONTDATA: {
                VARIANT: {
                  bold:               {offsetG: 0x391, variantG: "-Greek-Bold"},
                  "bold-fraktur":     {offsetG: 0x391, variantG: "-Greek-Bold"},
                  "bold-script":      {offsetG: 0x391, variantG: "-Greek-Bold"},
                  "-Greek-Bold":      {fonts:["MathJax_Greek-bold"]}
                }
              }
            });

            HTMLCSS.FONTDATA.FONTS['MathJax_Greek-bold'] = {
              directory: 'Greek/Bold',
              family: 'MathJax_Greek',
              weight: 'bold',
              testString: String.fromCharCode(0x393)+" "+String.fromCharCode(0x3A5)+" "+String.fromCharCode(0x39B),
              0x20: [0,0,250,0,0],               //  
              0xA0: [0,0,250,0,0],               //  
              0x393: [680,0,692,39,643],         // Γ
              0x394: [698,0,958,56,901],         // Δ
              0x398: [696,10,894,64,829],        // Θ
              0x39B: [698,0,806,40,765],         // Λ
              0x39E: [675,0,767,48,718],         // Ξ
              0x3A0: [680,0,900,39,860],         // Π
              0x3A3: [686,0,831,64,766],         // Σ
              0x3A5: [697,0,894,64,829],         // Υ
              0x3A6: [686,0,831,64,766],         // Φ
              0x3A8: [686,0,894,64,829],         // Ψ
              0x3A9: [696,1,831,51,779]          // Ω
            };
          }
          
          if (HTMLCSS.Font.testFont({family:"MathJax_Greek", style:"italic", testString: testString})) {
            HTMLCSS.Augment({
              FONTDATA: {
                VARIANT: {
                  italic:  {offsetG: 0x391, variantG: "-Greek-Italic"},
                  "-Greek-Italic": {fonts:["MathJax_Greek-italic"]}
                }
              }
            });

            HTMLCSS.FONTDATA.FONTS['MathJax_Greek-italic'] = {
              directory: 'Greek/Italic',
              family: 'MathJax_Greek',
              style: 'italic',
              testString: String.fromCharCode(0x393)+" "+String.fromCharCode(0x3A5)+" "+String.fromCharCode(0x39B),
              skew: {
                0x393: 0.0833,
                0x394: 0.167,
                0x398: 0.0833,
                0x39B: 0.167,
                0x39E: 0.0833,
                0x3A0: 0.0556,
                0x3A3: 0.0833,
                0x3A5: 0.0556,
                0x3A6: 0.0833,
                0x3A8: 0.0556,
                0x3A9: 0.0833,
                0x3B1: 0.0278,
                0x3B2: 0.0833,
                0x3B4: 0.0556,
                0x3B5: 0.0833,
                0x3B6: 0.0833,
                0x3B7: 0.0556,
                0x3B8: 0.0833,
                0x3B9: 0.0556,
                0x3BC: 0.0278,
                0x3BD: 0.0278,
                0x3BE: 0.111,
                0x3BF: 0.0556,
                0x3C1: 0.0833,
                0x3C2: 0.0833,
                0x3C4: 0.0278,
                0x3C5: 0.0278,
                0x3C6: 0.0833,
                0x3C7: 0.0556,
                0x3C8: 0.111,
                0x3D1: 0.0833,
                0x3D5: 0.0833,
                0x3F1: 0.0833,
                0x3F5: 0.0556
              },
              0x20: [0,0,250,0,0],               //  
              0xA0: [0,0,250,0,0],               //  
              0x393: [680,-1,615,31,721],        // Γ
              0x394: [716,0,833,48,788],         // Δ
              0x398: [704,22,763,50,740],        // Θ
              0x39B: [716,0,694,35,670],         // Λ
              0x39E: [678,0,742,53,777],         // Ξ
              0x3A0: [681,0,831,31,887],         // Π
              0x3A3: [683,0,780,58,806],         // Σ
              0x3A5: [705,0,583,28,700],         // Υ
              0x3A6: [683,0,667,24,642],         // Φ
              0x3A8: [683,0,612,21,692],         // Ψ
              0x3A9: [704,0,772,80,786],         // Ω
              0x3B1: [442,11,640,34,603],        // α
              0x3B2: [705,194,566,23,573],       // β
              0x3B3: [441,216,518,11,543],       // γ
              0x3B4: [717,10,444,36,451],        // δ
              0x3B5: [452,22,466,27,428],        // ε
              0x3B6: [704,204,438,44,471],       // ζ
              0x3B7: [442,216,497,21,503],       // η
              0x3B8: [705,10,469,35,462],        // θ
              0x3B9: [442,10,354,48,332],        // ι
              0x3BA: [442,11,576,49,554],        // κ
              0x3BB: [694,12,583,47,556],        // λ
              0x3BC: [442,216,603,23,580],       // μ
              0x3BD: [442,2,494,45,530],         // ν
              0x3BE: [704,205,438,21,443],       // ξ
              0x3BF: [441,11,485,34,476],        // ο
              0x3C0: [431,11,570,19,573],        // π
              0x3C1: [442,216,517,23,510],       // ρ
              0x3C2: [442,107,363,31,405],       // ς
              0x3C3: [431,11,571,31,572],        // σ
              0x3C4: [431,13,437,18,517],        // τ
              0x3C5: [443,10,540,21,523],        // υ
              0x3C6: [442,218,654,50,618],       // φ
              0x3C7: [442,204,626,25,600],       // χ
              0x3C8: [694,205,651,21,634],       // ψ
              0x3C9: [443,11,622,15,604],        // ω
              0x3D1: [705,11,591,21,563],        // ϑ
              0x3D5: [694,205,596,43,579],       // ϕ
              0x3D6: [431,10,828,19,823],        // ϖ
              0x3F1: [442,194,517,67,510],       // ϱ
              0x3F5: [431,11,406,40,382]         // ϵ
            };
          }
            
        }
          
        if (HTMLCSS.msieIE6) {
          
          var WinIE6 = "MathJax_WinIE6";
          HTMLCSS.FONTDATA.FONTS[WinIE6] = "WinIE6/Regular/Main.js";
          HTMLCSS.FONTDATA.RANGES.push({name: "arrows", low: 0x2190, high: 0x2199, offset: "AR"});

          var REMAP = {variant:"-WinIE6",
            0x21D2:0xE20A, 0x21D4:0xE20B,                               // \Rightarrow, \Leftrightarrow
            0x2200:0xE20C, 0x2202:0xE20D, 0x2203:0xE20E, 0x2207:0xE20F, // \forall, \partial, \exists, \nabla
            0x2208:0xE210, 0x220B:0xE211, 0x2215:0xE212, 0x221A:0xE213, // \in, \ni, /, \surd
            0x221D:0xE214, 0x221E:0xE215, 0x2220:0xE216, 0x2223:0xE217, // \propto, \infty, \angle, \vert
            0x2225:0xE218, 0x2227:0xE219, 0x2228:0xE21A, 0x2229:0xE21B, // \Vert, \wedge, \vee, \cap
            0x222A:0xE21C, 0x222B:0xE21D, 0x223C:0xE21E, 0x2248:0xE21F, // \cup, \int, \sim, \approx
            0x2260:0xE220, 0x2261:0xE221, 0x2264:0xE222, 0x2265:0xE223, // \ne, \equiv, \le, \ge
            0x226A:0xE224, 0x226B:0xE225, 0x2282:0xE226, 0x2283:0xE227, // \ll, \gg, \subset, \supset
            0x2286:0xE228, 0x2287:0xE229, 0x2295:0xE22A, 0x2299:0xE22B, // \subseteq, \supseteq, \oplus, \odot
            0x22A5:0xE22C, 0x25B3:0xE22D, 0x25BD:0xE22E, 0x25EF:0xE22F, // \bot, \bigtriangleup, \bigtriangledown, \bigcirc
            0x2660:0xE230, 0x2661:0xE231, 0x2662:0xE232, 0x2663:0xE233, // \spadesuit, \heartsuit, \diamondsuit, \clubsuit
            0x266D:0xE234, 0x266E:0xE235, 0x266F:0xE236,                // \flat, \naturl, \sharp
            0x2266:0xE2C5, 0x2267:0xE2C6, 0x226E:0xE2C7, 0x226F:0xE2C8, // \leqq, \geqq, \nless, \ngtr
            0x250C:0xE2CA, 0x2510:0xE2CB, 0x2514:0xE2CC, 0x2518:0xE2CD, // corners
            0x2571:0xE2CE, 0x2572:0xE2CF, 0x25A0:0xE2D0, 0x25A1:0xE2D1, // \diagup, \diagdown, \blacksquare, \square
            0x25B2:0xE2D2, 0x25B6:0xE2D4, 0x25BC:0xE2D5,                // \blacktriangle, \blacktriangleright, \blacktriangledown
            0x25BD:0xE2D6, 0x25C0:0xE2D7, 0x25CA:0xE2D8,                // \vartriangledown, \blacktriangleleft, \lozenge
            0x2234:0xE2D9, 0x2235:0xE2DA, 0x2252:0xE2DB, 0x2605:0xE2DC, // \therefor, \because, \fallingdotseq, \bigstar
            0x223D:0xE2DD                                               // \backsim
          };
          var REMAPBOLD = {variant:"-WinIE6",
            0x21D2:0xE24A, 0x21D4:0xE24B,                               // \Rightarrow, \Leftrightarrow
            0x2200:0xE24C, 0x2202:0xE24D, 0x2203:0xE24E, 0x2207:0xE24F, // \forall, \partial, \exists, \nabla
            0x2208:0xE250, 0x220B:0xE251, 0x2215:0xE252, 0x221A:0xE253, // \in, \ni, /, \surd
            0x221D:0xE254, 0x221E:0xE255, 0x2220:0xE256, 0x2223:0xE257, // \propto, \infty, \angle, \vert
            0x2225:0xE258, 0x2227:0xE259, 0x2228:0xE25A, 0x2229:0xE25B, // \Vert, \wedge, \vee, \cap
            0x222A:0xE25C, 0x222B:0xE25D, 0x223C:0xE25E, 0x2248:0xE25F, // \cup, \int, \sim, \approx
            0x2260:0xE260, 0x2261:0xE261, 0x2264:0xE262, 0x2265:0xE263, // \ne, \equiv, \le, \ge
            0x226A:0xE264, 0x226B:0xE265, 0x2282:0xE266, 0x2283:0xE267, // \ll, \gg, \subset, \supset
            0x2286:0xE268, 0x2287:0xE269, 0x2295:0xE26A, 0x2299:0xE26B, // \subseteq, \supseteq, \oplus, \odot
            0x22A5:0xE26C, 0x25B3:0xE26D, 0x25BD:0xE26E, 0x25EF:0xE26F, // \bot, \bigtriangleup, \bigtriangledown, \bigcirc
            0x2660:0xE270, 0x2661:0xE271, 0x2662:0xE272, 0x2663:0xE273, // \spadesuit, \heartsuit, \diamondsuit, \clubsuit
            0x266D:0xE274, 0x266E:0xE275, 0x266F:0xE276,                // \flat, \naturl, \sharp
            0x2266:0xE2C5, 0x2267:0xE2C6, 0x226E:0xE2C7, 0x226F:0xE2C8, // \leqq, \geqq, \nless, \ngtr
            0x250C:0xE2CA, 0x2510:0xE2CB, 0x2514:0xE2CC, 0x2518:0xE2CD, // corners
            0x2571:0xE2CE, 0x2572:0xE2CF, 0x25A0:0xE2D0, 0x25A1:0xE2D1, // \diagup, \diagdown, \blacksquare, \square
            0x25B2:0xE2D2, 0x25B6:0xE2D4, 0x25BC:0xE2D5,                // \blacktriangle, \blacktriangleright, \blacktriangledown
            0x25BD:0xE2D6, 0x25C0:0xE2D7, 0x25CA:0xE2D8,                // \vartriangledown, \blacktriangleleft, \lozenge
            0x2234:0xE2D9, 0x2235:0xE2DA, 0x2252:0xE2DB, 0x2605:0xE2DC, // \therefor, \because, \fallingdotseq, \bigstar
            0x223D:0xE2DD                                               // \backsim
          };
          var VARNORMAL = {offsetAR:0xE200, variantAR:"-WinIE6", remap: REMAP};
          var VARBOLD   = {offsetAR:0xE240, variantAR:"-WinIE6", remap: REMAPBOLD};

          HTMLCSS.Augment({
            FONTDATA: {
              VARIANT: {
                "normal": VARNORMAL,
                "bold":   VARBOLD,
                "italic": VARNORMAL,
                "bold-italic": VARBOLD,
                "-largeOp": {fonts:[WinIE6,"MathJax_Size2","MathJax_Size1","MathJax_Main"],
                             remap: {0x220F:0xE290, 0x2211:0xE291, 0x222B:0xE295, 0x222E:0xE296}},
                "-smallOp": {fonts:[WinIE6,"MathJax_Size1","MathJax_Main"],
                             remap: {0x220F:0xE280, 0x2211:0xE281, 0x222B:0xE285, 0x222E:0xE286}},
                "-WinIE6":  {fonts:[WinIE6]}
	      },
	      DELIMITERS: {
	        0x221A: {
	          0:[1,WinIE6,null,0xE213], 1:[1.2,WinIE6,null,0xE282], 2:[1.8,WinIE6,null,0xE292],
	          3:[2.4,WinIE6,null,0xE2A2], 4:[3,WinIE6,null,0xE2B2]
	        },
                0x2223: {0:[1,WinIE6,null,0xE217], 1:{ext:[0xE217,WinIE6]}},
                0x2225: {0:[1,WinIE6,null,0xE218], 1:{ext:[0xE218,WinIE6]}},
                0x2190: {0:[.889,WinIE6,null,0xE200], 1:{left:[0xE200,WinIE6]}},
                0x2191: {0:[.888,WinIE6,null,0xE201], 1:{top:[0xE287,WinIE6], ext:[0xE289,WinIE6]}},
                0x2192: {0:[.889,WinIE6,null,0xE202], 1:{right:[0xE202,WinIE6]}},
                0x2193: {0:[.888,WinIE6,null,0xE203], 1:{bot:[0xE288,WinIE6], ext:[0xE289,WinIE6]}},
                0x2194: {0:[1,WinIE6,null,0xE204], 1:{left:[0xE200,WinIE6],right:[0xE202,WinIE6]}},
                0x2195: {0:[1.044,WinIE6,null,0xE203], 1:{top:[0xE287,WinIE6],bot:[0xE288,WinIE6], ext:[0xE289,WinIE6]}}
                
              }
            }
          });
          
        }
        
      },
      
      Chrome: function (browser) {
        if (browser.isPC) {
          HTMLCSS.Augment({
            FONTDATA: {
              VARIANT: {
                italic: {remap: {0x64: [0x64, "-WinChrome"]}},
                "-tex-caligraphic": {remap: {0x54: [0x54, "-WinChrome"]}},
                "-largeOp": {remap: {0x2A04: [0x2A04, "-WinChrome"], 0x230A: [0x230A, "-WinChrome"]}},
                "-WinChrome": {fonts:["MathJax_WinChrome"]}
              }
            }
          });
        
          HTMLCSS.FONTDATA.FONTS['MathJax_WinChrome'] = {
            directory: 'WinChrome/Regular',
            family: 'MathJax_WinChrome',
            testString: "@ B C T d "+String.fromCharCode(0x230A)+" "+String.fromCharCode(0x2A04),
            skew: {
              0x54: 0.0278
            },
            0x20: [0,0,250,0,0],               //  
            0x40: [705,11,778,56,722],         // @
            0x42: [687,0,818,39,753],          // B
            0x43: [705,21,716,150,812],        // C
            0x54: [717,69,545,34,834],         // T
            0x64: [694,11,511,100,567],        // d
            0xA0: [0,0,250,0,0],               //  
            0x230A: [40,1759,528,224,511],     // ⌊
            0x2A04: [0,1399,1111,55,1055]      // ⨄
          };
        }
      }

    });
  }
      
  //
  //  Create @font-face stylesheet for the declared fonts
  //
  if (HTMLCSS.allowWebFonts) {
    (function () {
      var faces = [], FONTS = HTMLCSS.FONTDATA.FONTS, AVAIL = HTMLCSS.config.availableFonts;
      for (var name in FONTS) {
        if (FONTS[name].family) {
          if (AVAIL && AVAIL.length && HTMLCSS.Font.testFont(FONTS[name])) {
            FONTS[name].available = true;
          } else {
            FONTS[name].isWebFont = true;
            if (HTMLCSS.FontFaceBug) {FONTS[name].family = name}
            faces.push(HTMLCSS.Font.fontFace(name));
          }
        }
      }
      if (!HTMLCSS.config.preloadWebFonts) {HTMLCSS.config.preloadWebFonts = []}
      HTMLCSS.config.preloadWebFonts.push("MathJax_Main","MathJax_Math-italic","MathJax_Size1");
      if (faces.length) {HTMLCSS.config.styles["@font-face"] = faces}
    })();
  }

  AJAX.loadComplete(HTMLCSS.fontDir + "/fontdata.js");
  
})(MathJax.OutputJax["HTML-CSS"],MathJax.InputJax.TeX,MathJax.ElementJax.mml,MathJax.Ajax);

